{
  "slug": "fort-yargo-ultra",
  "lastUpdated": "2026-02-01T20:54:43.778Z",
  "summary": "The Fort Yargo Ultra is a scenic trail race held in Winder, Georgia, featuring a fast and runnable 15.6-mile loop that circles a 260-acre lake within the historic Fort Yargo State Park. Offering both 25K and 50K distances, the event is celebrated for its dense woods and rolling terrain, making it an ideal choice for first-time ultra runners and seasoned athletes chasing a personal best.",
  "uniqueFeatures": [
    "Canine-Friendly Racing: The event includes a dedicated Canine Run for the 25K distance, allowing participants to compete alongside their dogs starting 15 minutes after the human-only wave.",
    "Historical Landmark Course: Runners pass near a restored 1792 log fort built by early settlers for protection, adding a unique historical element to the natural landscape.",
    "Lakeside Glamping Accommodations: The park offers specialized lakeside 'glamping' yurts and historic cottages, allowing racers to stay overnight just steps away from the start and finish lines."
  ],
  "media": [
    {
      "url": "https://www.dayfirepodcast.com/#/ep-66-ultra-runner-noah-cochran/",
      "title": "Ep. 66: Ultra Runner Noah Cochran",
      "type": "podcast",
      "source": "Day Fire Podcast",
      "summary": "An interview with 2020 Fort Yargo Ultra 50K winner Noah Cochran, discussing his transition to ultra running and his experience winning the event.",
      "years": [
        2020
      ],
      "contentSummary": "This podcast episode features an interview with ultra runner Noah Cochran about his experiences and stories within the outdoor running community.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Noah",
          "lastName": "Cochran"
        }
      ]
    },
    {
      "url": "https://www.trainingpeaks.com/blog/covid-19-racing-guidelines-for-athletes/",
      "title": "COVID-19 Racing Guidelines for Athletes",
      "type": "article",
      "source": "TrainingPeaks",
      "summary": "An editorial analysis of race management that uses the Fort Yargo Ultra as a model for successful trail race logistics and athlete wave starts.",
      "years": [
        2020
      ],
      "contentSummary": "This article provides comprehensive guidelines for endurance athletes transitioning back to in-person racing during the COVID-19 pandemic, emphasizing self-sufficiency, logistical changes, and safety protocols.",
      "qualityScore": 7,
      "tags": [
        "Other"
      ],
      "racers": []
    }
  ]
}