{
  "slug": "warbird-100",
  "lastUpdated": "2026-02-01T20:53:05.419Z",
  "summary": "The Warbird 100 is a grueling 103-mile mountain ultra that traverses the rugged 'hollers' and remote ridges of the Daniel Boone National Forest in Eastern Kentucky. Starting and ending in Hyden, the race immerses runners in technical singletrack and steep climbs, culminating in a test of endurance through the deep Appalachian wilderness.",
  "uniqueFeatures": [
    "Navigates the extensive Redbird Crest Trail and historic strip-mine roads, offering a unique blend of wild backcountry and industrial-frontier terrain.",
    "Features a high-energy 'finish line integration' where 50k and half-marathon participants merge with 100-mile runners for the final eight miles to provide mutual support and camaraderie.",
    "Hosted by the 'Trail Sick' crew, the event is famous for its extreme hospitality and family-like atmosphere in a remote environment with virtually no cell service."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=NUqAHIO9bRv",
      "title": "Warbird 100 Ultra: Runner Profile and Race Discussion",
      "type": "interview",
      "source": "YouTube",
      "summary": "An in-depth interview and profile discussing the experience of running the Warbird 100, focusing on the mental and physical challenges of the 100-mile distance in Kentucky.",
      "years": [
        2025
      ],
      "contentSummary": "This content features a runner profile and in-depth discussion centered on the Warbird 100 Ultra race.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://www.youtube.com/watch?v=Eq5NeUm3oRh",
      "title": "Interview with Trail Sick's John Maggard",
      "type": "interview",
      "source": "Kentucky Cycling",
      "summary": "A long-form interview with the race director discussing the origins of the Trail Sick brand and the development of hardcore endurance events on the Redbird Crest Trail.",
      "years": [
        2021,
        2024
      ],
      "contentSummary": "This interview features John Maggard of Trail Sick, discussing his experiences and perspectives within the trail running community.",
      "qualityScore": 7,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "John",
          "lastName": "Maggard"
        }
      ]
    }
  ]
}