{
  "slug": "hurricane-creek-half-marathon",
  "lastUpdated": "2026-02-01T20:57:29.983Z",
  "summary": "Set against the dramatic backdrop of the Wallowa Mountains in Joseph, Oregon, the Hurricane Creek Half Marathon is a breathtaking out-and-back race that transitions from town streets to rugged wilderness. Runners face a challenging 'mile-high' ascent, climbing from 4,200 feet to over 5,100 feet while enjoying panoramic views of the Eagle Cap Wilderness and the Seven Devils range.",
  "uniqueFeatures": [
    "Hybrid terrain course that features a distinct transition from three miles of paved road to six miles of remote, maintained dirt paths before returning to the finish.",
    "Breathtaking mountain scenery often compared to the Swiss Alps, with constant views of the Eagle Cap Wilderness, high alpine valleys, and the Seven Devils mountains.",
    "Unpredictable high-altitude racing conditions where participants are advised to prepare for everything from bright sunshine to late-spring snow."
  ],
  "media": [
    {
      "url": "https://runoregonblog.com/2025/05/15/the-hurricane-creek-half-is-making-landfall/",
      "title": "The Hurricane Creek Half is Making Landfall",
      "type": "article",
      "source": "Run Oregon",
      "summary": "This race profile provides a detailed overview of the Hurricane Creek Half Marathon, highlighting its scenic route through Joseph, Oregon, and the climb into the Wallowa Mountains.",
      "years": [
        2025,
        2024,
        2022
      ],
      "contentSummary": "The Hurricane Creek Half, 5-miler, and 5k events on May 24th in Joseph, Oregon, offer a scenic but challenging course with significant elevation gain and serve as a fundraiser for Runners of the Sage.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": [
        {
          "firstName": "Matt",
          "lastName": "Rasmussen"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=A8f9LzB-wO8",
      "title": "THE most epic half marathon | The story of the Hurricane Creek Half",
      "type": "article",
      "source": "The Sub Hub Podcast",
      "summary": "An evergreen narrative episode that explores the origins of the race and showcases the breathtaking terrain of the Eagle Cap Wilderness and Wallowa Mountains.",
      "years": [
        2023,
        2022
      ],
      "contentSummary": "A documentary-style video exploring the unique challenges and narrative behind the Hurricane Creek Half marathon.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": []
    },
    {
      "url": "https://www.wvliving.com/building-trails-building-community/",
      "title": "Building Trails, Building Community",
      "type": "article",
      "source": "WV Living Magazine",
      "summary": "An editorial feature exploring the development of the Meeks Mountain Trails and the launch of the Hurricane Hundred 100K, highlighting the race's impact on the local community and its role in West Virginia's trail running scene.",
      "years": [
        2022
      ],
      "contentSummary": "This article explores the development of the Meeks Mountain Trail Alliance in Hurricane, West Virginia, highlighting the community-led effort to build a 26-mile trail system and its role in hosting local endurance events.",
      "qualityScore": 6,
      "tags": [
        "Other"
      ],
      "racers": []
    }
  ]
}