{
  "slug": "leavenworth-trail-fest",
  "lastUpdated": "2026-02-01T20:57:14.956Z",
  "summary": "Nestled in Washington’s famous Bavarian-themed village, the Leavenworth Trail Fest is an exhilarating mountain running event that challenges athletes with 55k, 27k, and 5k distances. Runners traverse a diverse landscape of flowy mountain bike trails and rugged ridgelines, offering panoramic views that shift from lush alpine forests to the stark beauty of the Eastern Cascades' high desert.",
  "uniqueFeatures": [
    "Bavarian Cultural Traditions: The race is officially signaled by the sounding of traditional Leavenworth Alpenhorns and features German-themed festival games like Hammerslag, a nail-hammering competition.",
    "Summit King & Queen Challenge: This 'race-within-a-race' honors the fastest male and female climbers to reach the course's high point at the Tumwater Ridge paraglider launch area.",
    "Ecological Terrain Contrast: The course offers a rare transition between two distinct ecosystems, moving from steep alpine ridges into the arid 'dry alpine desert' landscape of Freund Canyon."
  ],
  "media": [
    {
      "url": "https://mountainrunningraces.com/leavenworth-trail-fest/",
      "title": "Leavenworth Trail Fest: Your Destination Mountain Running Festival",
      "type": "article",
      "source": "Mountain Running Races",
      "summary": "An evergreen guide to the festival's three primary courses (5k, 27k, and 55k), detailing the terrain transitions from alpine ridges to fast forest service roads in the Eastern Cascades.",
      "years": [
        2024,
        2025,
        2026
      ],
      "contentSummary": "The Leavenworth Trail Fest in Washington offers 5k, 27k, and 55k mountain running courses alongside a Bavarian-themed festival featuring vendors, kids' races, and community events.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://www.youtube.com/watch?v=R9I1K5v_pQc",
      "title": "Vert News: Leavenworth Trail Fest and Course Overview",
      "type": "news",
      "source": "Mountain Running Races",
      "summary": "An editorial video interview and news update providing a comprehensive profile of the Leavenworth Skyline 27k and Ski Hill 55k courses within the Vert Running Series.",
      "years": [
        2024
      ],
      "contentSummary": "This Vert News segment provides a detailed overview of the Leavenworth Trail Fest, focusing on the specific features and terrain of the event's race courses.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}