{
  "slug": "cocodona",
  "lastUpdated": "2026-02-01T18:29:41.519Z",
  "summary": "The Cocodona 250 is an epic 250-mile point-to-point ultramarathon that traverses the heart of Arizona, taking runners from the sweltering Sonoran Desert to the high-alpine forests of Flagstaff. This monumental journey pushes athletes to their limits with over 40,000 feet of elevation gain through iconic landscapes like the Bradshaw Mountains, the red rocks of Sedona, and the historic streets of Prescott.",
  "uniqueFeatures": [
    "Historical Landmark Access: The route features stops at the historic Crown King Saloon and a passage through Prescott's famous Whiskey Row, blending rugged wilderness with Arizona's frontier history.",
    "Ecological Crossroads: Runners traverse a complete cross-section of Arizona’s landscapes, transitioning from Saguaro-studded desert floors at 2,000 feet to high-alpine ponderosa pine forests near 9,000 feet.",
    "The Mt. Elden Crux: The race concludes with a punishing final climb to the 9,241-foot summit of Mt. Elden, followed by a steep 2,000-foot descent that tests the remaining leg strength of athletes who have already covered 250 miles."
  ],
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=k0HkYULFVvA",
      "title": "THE CHASE | Cocodona 250 Full Documentary",
      "channelTitle": "Aravaipa Running",
      "publishedYear": 2025
    },
    {
      "url": "https://www.youtube.com/watch?v=-1sKhK-eZyg",
      "title": "250 Miles Unfiltered | A Raw Look at the Cocodona 250 Mile Ultra Marathon Across Arizona",
      "channelTitle": "Aravaipa Running",
      "publishedYear": 2025
    },
    {
      "url": "https://www.youtube.com/watch?v=CoPZDP96700",
      "title": "Cocodona 250 Miles in 80 seconds",
      "channelTitle": "Ultra Marathon Trail Running with Simon",
      "publishedYear": 2025
    },
    {
      "url": "https://www.youtube.com/watch?v=SCMaSBpzpCk",
      "title": "Cocodona 250 2023 Preview Show",
      "channelTitle": "Aravaipa Running",
      "publishedYear": 2023
    },
    {
      "url": "https://www.youtube.com/watch?v=2sCvvBReOlk",
      "title": "INAUGURAL YEAR | A story about the first ever Cocodona 250",
      "channelTitle": "Aravaipa Running",
      "publishedYear": 2021
    }
  ],
  "media": [
    {
      "url": "https://podcasts.apple.com/us/podcast/everyday-ultra/id1591552554?i=1000655653835",
      "title": "Mental Strategies and How to Conquer a 200+ Miler",
      "type": "podcast",
      "source": "Everyday Ultra Podcast",
      "summary": "A strategy-focused episode that uses the Cocodona 250 as a case study for managing the mental 'lows' and gear logistics inherent in multi-day ultramarathons.",
      "years": [
        2024
      ]
    },
    {
      "url": "https://podcasts.apple.com/us/podcast/singletrack/id1572382413",
      "title": "How The Cocodona 250 Is Changing Ultrarunning Forever",
      "type": "podcast",
      "source": "Singletrack Podcast",
      "summary": "A timeless discussion on the race's impact on the sport's media landscape, professionalization, and the cultural shift toward 'mega-distance' trail events.",
      "years": [
        2025
      ]
    }
  ]
}