{
  "slug": "ring-the-springs",
  "lastUpdated": "2026-02-01T20:58:13.841Z",
  "summary": "Ring the Springs is a premier trail race series in Colorado Springs that offers an immersive \"grand tour\" of the city’s iconic park systems and rugged alpine terrain. Starting and finishing at the historic Rock Ledge Ranch in Garden of the Gods, the flagship 100K course pushes runners through 11,000 feet of elevation gain to the thin air of the 11,488-foot Mount Rosa summit.",
  "uniqueFeatures": [
    "Iconic Red Rock Setting: The race starts and finishes at the historic Rock Ledge Ranch within Garden of the Gods, providing a world-class backdrop of towering red sandstone formations.",
    "Mount Rosa Summit: The 100K course reaches a staggering maximum elevation of 11,488 feet at the top of Mount Rosa, offering breathtaking panoramic views of Pikes Peak and the Front Range.",
    "Diverse Trail Connectivity: It serves as a comprehensive tour of Colorado Springs' geography, seamlessly linking urban parks like Bear Creek with the technical, remote wilderness of Pike National Forest."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=5V5r3_I_2C0",
      "title": "THE PARTICIPANT (Short Film) | Understanding the 100 mile distance | Ring The Springs 100 Miler",
      "type": "article",
      "source": "Aravaipa Running",
      "summary": "A high-quality 18-minute short film that provides a cinematic look at the inaugural 100-mile race, exploring the physical and mental demands of the rugged Colorado Springs course.",
      "years": [
        2022
      ],
      "contentSummary": "This short film provides an in-depth look at the psychological and physical experience of completing the 100-mile distance at the Ring The Springs 100 Miler.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": []
    },
    {
      "url": "https://sarahrunning.substack.com/p/a-new-nexus-for-colorado-trail-runners",
      "title": "A New Nexus for Colorado Trail Runners",
      "type": "interview",
      "source": "Sarah Lavender Smith",
      "summary": "An editorial feature that details the history, course scouting, and the local trail community's response to the creation of the Ring the Springs ultramarathon.",
      "years": [
        2022
      ],
      "contentSummary": "Sarah Lavender Smith interviews race director Morgan Weinberg about Aravaipa Running's strategic expansion into Colorado, highlighting new community initiatives and upcoming premier races.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Jamil",
          "lastName": "Coury"
        },
        {
          "firstName": "Nick",
          "lastName": "Coury"
        },
        {
          "firstName": "Morgan",
          "lastName": "Weinberg"
        },
        {
          "firstName": "Brian",
          "lastName": "Pilger"
        }
      ]
    }
  ]
}