{
  "slug": "valkyrie-trail-race",
  "lastUpdated": "2026-02-01T20:56:24.049Z",
  "summary": "The Valkyrie Trail Race is a vibrant, women-focused event held in the scenic Cheyenne Mountain State Park near Colorado Springs, offering distances from a 4-miler to a 50K ultramarathon. Runners traverse a diverse landscape of open meadows, technical singletrack, and pine-shaded canyons, all while supported by an empowering community atmosphere designed to celebrate female grit and camaraderie.",
  "uniqueFeatures": [
    "Women-focused celebration: The event is specifically designed to empower and celebrate female athletes of all experience levels, fostering a highly supportive and inclusive environment.",
    "High-altitude technical terrain: Runners navigate a mix of smooth limestone paths and technical, boulder-strewn singletrack at elevations ranging from 6,000 to nearly 7,000 feet.",
    "Eco-conscious cupless racing: To minimize the environmental impact on the state park's ecosystem, the race operates as a cupless event, requiring participants to carry their own reusable hydration systems."
  ],
  "media": [
    {
      "url": "https://www.irunfar.com/werunfar-profile-the-ricks-family",
      "title": "WeRunFar Profile: The Ricks Family",
      "type": "article",
      "source": "iRunFar",
      "summary": "An in-depth editorial profile of the Ricks family, the founders of Mad Moose Events, exploring their roots in Colorado Springs and their philosophy of building community through trail racing.",
      "years": [
        2019
      ],
      "contentSummary": "This article provides a comprehensive profile of the Ricks family, exploring their individual running backgrounds and their collective work running Mad Moose Events.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Denise",
          "lastName": "Ricks"
        },
        {
          "firstName": "Jordan",
          "lastName": "Ricks"
        },
        {
          "firstName": "Justin",
          "lastName": "Ricks"
        },
        {
          "firstName": "Kylah",
          "lastName": "Ricks"
        },
        {
          "firstName": "Malachi",
          "lastName": "Ricks"
        }
      ]
    }
  ]
}