{
  "slug": "lost-soul-ultra",
  "lastUpdated": "2026-02-01T21:00:12.943Z",
  "summary": "Held in the scenic river valley of Lethbridge, Alberta, the Lost Soul Ultra is a legendary trail race famously billed as the toughest and nicest race on the prairies. Athletes tackle relentless coulee hills in distances ranging from 54K to 100 miles, supported by a close-knit community and aid stations often voted the best in the sport.",
  "uniqueFeatures": [
    "Instead of traditional medals, finishers are celebrated with large, uniquely etched rocks that symbolize the rugged terrain of the Oldman River valley.",
    "Despite being in the supposedly flat prairies, the loop-based course involves roughly 16 significant hill climbs per lap, accumulating approximately 1,200 meters of elevation change every 54 kilometers.",
    "The race trails traverse significant historical territory, passing near the site of the last major First Nations battle on Canadian soil between the Blackfoot and Cree Confederacies."
  ],
  "media": [
    {
      "url": "https://obstacleracingmedia.com/race-review/lost-soul-ultramarathon/",
      "title": "The Lost Soul Ultramarathon",
      "type": "article",
      "source": "Obstacle Racing Media",
      "summary": "A comprehensive race review and course guide detailing the technical aspects of the 54km loop, the coulee terrain, and the quality of the event organization.",
      "years": [
        2017
      ],
      "contentSummary": "A detailed first-person race report by Glenn Hole covering his experience at the 2017 Lost Soul Ultramarathon in Lethbridge, Alberta. The article describes the technical challenges of the coulee terrain, the extreme 37-degree heat, and the exceptional organization and volunteer support of the event. Hole shares his personal journey through heat exhaustion during the 54km loop, providing insights into the race's unique atmosphere, aid stations, and the 'toughest race on the prairies' reputation.",
      "qualityScore": 8,
      "tags": [
        "Race Report",
        "Ultramarathon",
        "Trail Running",
        "Lost Soul Ultra",
        "Endurance"
      ],
      "racers": [
        {
          "firstName": "Glenn",
          "lastName": "Hole"
        }
      ]
    },
    {
      "url": "https://www.trailrunnermag.com/people/like-father-like-daughter/",
      "title": "Like Father, Like Daughter",
      "type": "interview",
      "source": "Trail Runner Magazine",
      "summary": "A race profile highlighting the unique community atmosphere and the specific challenges of the 100-mile course through a record-breaking performance story.",
      "years": [
        2017
      ],
      "contentSummary": "An interview with Jeff and Marcy Smucker, a father-daughter duo from Pennsylvania who secured age group titles in the Trail Runner Trophy Series. They discuss their entry into the sport, their shared training runs in the mountains of central Pennsylvania, and their experiences competing in various trail challenges like Hyner View and Rothrock.",
      "qualityScore": 8,
      "tags": [
        "Interview",
        "Trail Runner Trophy Series",
        "Trail Running",
        "Age Group Champions",
        "Pennsylvania"
      ],
      "racers": [
        {
          "firstName": "Jeff",
          "lastName": "Smucker"
        },
        {
          "firstName": "Marcy",
          "lastName": "Smucker"
        }
      ]
    },
    {
      "url": "https://www.irunfar.com/werunfar-profile-elinor-fish",
      "title": "WeRunFar Profile: Elinor Fish",
      "type": "article",
      "source": "iRunFar",
      "summary": "An athlete profile that cites the 2003 Lost Soul Ultra 50k as a foundational milestone for one of the most prominent voices in the trail running media industry.",
      "years": [
        2020
      ],
      "contentSummary": "An in-depth profile of Elinor Fish, a Canadian trail runner and the founder of Run Wild Retreats + Wellness. The article explores her transition from a competitive athlete and editor at Trail Runner magazine to a leader in the wellness space. It details her 2010 Leadville 100 finish, the subsequent health burnout that led her to study mindfulness, and how she scaled her retreat business into an international organization focused on stress management for women runners.",
      "qualityScore": 9,
      "tags": [
        "WeRunFar Profile",
        "Athlete Profile",
        "Mindfulness",
        "Women's Running",
        "Burnout",
        "Leadville 100",
        "Wellness",
        "Trail Running"
      ],
      "racers": [
        {
          "firstName": "Elinor",
          "lastName": "Fish"
        },
        {
          "firstName": "Magi",
          "lastName": "Scallion"
        }
      ]
    },
    {
      "url": "https://runningmagazine.ca/the-scene/former-alberta-premier-rachel-notley-runs-and-chats-with-ultrarunners/",
      "title": "Former Alberta premier Rachel Notley runs and chats with ultrarunners",
      "type": "article",
      "source": "Canadian Running Magazine",
      "summary": "A narrative piece that explores the race's most difficult landmarks, such as the punishing final climb of Haybale Hill, and its connection to the local running community.",
      "years": [
        2020
      ],
      "contentSummary": "A narrative account of a group run in Lethbridge featuring former Alberta premier Rachel Notley and local ultrarunners. The piece details their exploration of the local coulees and the High Level bridge while discussing Notley's training for Melissa’s Half Marathon, the history of the Lost Soul Ultra, and the intersection of distance running and addiction recovery.",
      "qualityScore": 7,
      "tags": [
        "Community",
        "Trail Running",
        "Profile",
        "Lethbridge"
      ],
      "racers": [
        {
          "firstName": "Rachel",
          "lastName": "Notley"
        },
        {
          "firstName": "Chantelle",
          "lastName": "Erickson"
        },
        {
          "firstName": "Marc",
          "lastName": "Hayward"
        },
        {
          "firstName": "Carol",
          "lastName": "Williams"
        }
      ]
    },
    {
      "url": "https://www.zenseekers.com/story/going-flow-low-impact-and-charged-lethbridge-bucketlistab",
      "title": "Going With the Flow: Low Impact and Charged Up in Lethbridge",
      "type": "article",
      "source": "ZenSeekers",
      "summary": "A profile of the race featuring director Dean Johnson, discussing the event's 20-year history and the community-driven spirit behind the 'toughest and nicest' race on the prairies.",
      "years": [
        2019
      ],
      "contentSummary": "This article explores the outdoor recreation and 'flow' of Lethbridge, Alberta, featuring the Nikka Yuko Japanese Gardens, urban cycling corridors, and a trail run along the Lost Soul Ultra Marathon course.",
      "qualityScore": 6,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Dean",
          "lastName": "Johnson"
        },
        {
          "firstName": "Chris",
          "lastName": "Istace"
        }
      ]
    },
    {
      "url": "https://www.trailrunnermag.com/people/running-across-the-ages/",
      "title": "Running Across the Ages",
      "type": "interview",
      "source": "Trail Runner Magazine",
      "summary": "This editorial highlights the race's role in the Trail Runner Trophy Series, featuring local record-breaker Chelsey Topping and describing the intense pit-stop style atmosphere of the aid stations.",
      "years": [
        2017,
        2018
      ],
      "contentSummary": "This article profiles age-group leaders of the 2014 Trail Runner Trophy Series, featuring interviews with Louis Levesque, Stephen Bridson, and Vivian Doorn along with a series leaderboard.",
      "qualityScore": 6,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Louis",
          "lastName": "Levesque"
        },
        {
          "firstName": "Stephen",
          "lastName": "Bridson"
        },
        {
          "firstName": "Vivian",
          "lastName": "Doorn"
        },
        {
          "firstName": "Jeremy",
          "lastName": "Bradford"
        },
        {
          "firstName": "Clay",
          "lastName": "Williams"
        },
        {
          "firstName": "Jenny",
          "lastName": "Kroeger"
        },
        {
          "firstName": "Mindy",
          "lastName": "Coolman"
        },
        {
          "firstName": "Traci",
          "lastName": "Falbo"
        },
        {
          "firstName": "Blake",
          "lastName": "Davenport"
        },
        {
          "firstName": "Adam",
          "lastName": "Russel"
        },
        {
          "firstName": "Jeff",
          "lastName": "Smucker"
        },
        {
          "firstName": "Llew",
          "lastName": "Williams"
        },
        {
          "firstName": "Leslie",
          "lastName": "Opatril"
        },
        {
          "firstName": "Johanna",
          "lastName": "Ohm"
        },
        {
          "firstName": "Brianna",
          "lastName": "Bair"
        },
        {
          "firstName": "Kathy",
          "lastName": "Blair"
        },
        {
          "firstName": "Nola",
          "lastName": "Kinaston"
        },
        {
          "firstName": "Ali",
          "lastName": "Turfe"
        }
      ]
    },
    {
      "url": "https://podcasts.apple.com/ca/podcast/grp-154-lost-soul-legends-25-years-one-tough-trail/id1546014498?i=1000665389658",
      "title": "Lost Soul Legends: 25 Years, One Tough Trail",
      "type": "podcast",
      "source": "Gotta Run Podcast",
      "summary": "An anniversary retrospective with founder Marc Hayward, covering 25 years of race history, aid station lore, and the origins of the 100-mile event in Alberta.",
      "years": [
        2024
      ],
      "contentSummary": "Mark Hayward, a former race director and inaugural finisher, joins the Gotta Run Podcast to recount the 25-year history and community lore of the Lost Soul Ultra.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Mark",
          "lastName": "Hayward"
        }
      ]
    }
  ]
}