{
  "slug": "texas-ultra-series",
  "lastUpdated": "2026-02-01T20:50:40.410Z",
  "summary": "The Texas Ultra Series is a multi-event endurance challenge that traverses the vast and varied landscapes of the Lone Star State, from the rugged canyons of the west to the piney woods of the east. Organized by the Texas Outlaw Running Company, the series culminates in a high-stakes 100K Championship that draws elite trail runners to compete for significant cash prizes in the heart of Central Texas.",
  "uniqueFeatures": [
    "Interlocking State Medals: Each race in the series awards a specific regional medal designed to interlock with the others, eventually forming a complete map of Texas that can be displayed in a custom wooden case.",
    "The Path to the Championship: The series utilizes a unique qualification system where the top seven male and female finishers from regional events earn a spot in the 'Big Texas Ultra' 100K Championship to compete for a prize purse.",
    "Regional Ecoregion Tour: Participants experience five distinct Texas environments, including the soft gravel trails of North Texas, the rocky single-track of Lake Meredith, and the technical limestone terrain of the Lake Georgetown Rim Trail."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=Fj-P6E9nS9k",
      "title": "The North Texas Ultra | Trail & Ultra Mini Doc",
      "type": "article",
      "source": "Texas Outlaw Running Series",
      "summary": "A documentary-style profile of the North Texas Ultra course at Fort Richardson State Park, featuring interviews with athletes on the specific challenges of the regional terrain.",
      "years": [
        2024,
        2025
      ],
      "contentSummary": "This mini-documentary provides an editorial look at the race experience and trail environment of the North Texas Ultra.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": []
    },
    {
      "url": "https://irunfar.com/2010-rocky-raccoon-100-a-first-timer-account",
      "title": "2010 Rocky Raccoon 100: A First-Timer Account",
      "type": "article",
      "source": "iRunFar",
      "summary": "A timeless first-person narrative and course guide for one of Texas's most iconic 100-milers, detailing the unique challenges of the Huntsville trails.",
      "years": [
        2010
      ],
      "contentSummary": "Ashley Arnold provides a detailed first-hand account of her first attempt at the 100-mile distance during the 2010 Rocky Raccoon 100, including her eventual DNF.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Ashley",
          "lastName": "Arnold"
        }
      ]
    }
  ]
}