{
  "slug": "north-fork-50-mile-50k",
  "lastUpdated": "2026-02-01T20:57:32.879Z",
  "summary": "The North Fork 50 Mile/50K is a premier mountain ultramarathon held in the Buffalo Creek Recreation Area of Colorado's Pike National Forest. Starting and finishing near the town of Pine, the race offers a high-altitude challenge on 100% soft-surface trails that wind through lush ponderosa pines and stark historic burn scars.",
  "uniqueFeatures": [
    "Historic Burn Scar Views: The course traverses the sites of the 1996 Buffalo Creek and 2000 High Meadows fires, providing runners with a unique landscape of regenerating forest and unobstructed, panoramic views of granite rock formations.",
    "Fire Department Benefit: A significant portion of race proceeds is donated to the North Fork Volunteer Fire Department, the local agency that fought the very wildfires that shaped the modern course terrain.",
    "Exclusively Ultramarathon: To maintain a dedicated ultra-running community atmosphere and avoid trail congestion, the event deliberately offers no distances shorter than the 50K, focusing entirely on the long-distance experience."
  ],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=RIsV6oIcl6Y",
      "title": "EVERY YEAR | Jack Higgs & the North Fork 50 Mile",
      "type": "article",
      "source": "Aravaipa Originals",
      "summary": "A timeless documentary-style feature and interview exploring the legacy of the race through the eyes of a runner who has completed every edition since its inception.",
      "years": [
        2010,
        2024,
        2025
      ],
      "contentSummary": "This video content features Jack Higgs sharing his personal experience and annual tradition of competing in the North Fork 50 Mile ultramarathon.",
      "qualityScore": 6,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Jack",
          "lastName": "Higgs"
        }
      ]
    },
    {
      "url": "https://www.trailrunnermag.com/health/heart-stopping/",
      "title": "Heart Stopping",
      "type": "article",
      "source": "Trail Runner Magazine",
      "summary": "A feature article exploring heart health in ultrarunners through the narrative of Bill Fanselow’s victory at the North Fork 50 Mile and his subsequent medical challenges.",
      "years": [
        2023
      ],
      "contentSummary": "This article explores the risk of atrial flutter in long-term endurance athletes through the medical experience and recovery of trail runner Bill Fanselow.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Bill",
          "lastName": "Fanselow"
        },
        {
          "firstName": "Geoff",
          "lastName": "Roes"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=S6C6R6kS-vI",
      "title": "EVERY YEAR | Jack Higgs & the North Fork 50 Mile | Aravaipa Originals",
      "type": "article",
      "source": "Aravaipa Running",
      "summary": "A documentary-style media piece profiling long-time participant Jack Higgs and the historical community culture of the North Fork 50 ultramarathon.",
      "years": [
        2010,
        2025
      ],
      "contentSummary": "A documentary-style feature from Aravaipa Originals highlighting Jack Higgs' experience and history with the North Fork 50 Mile trail race.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Jack",
          "lastName": "Higgs"
        }
      ]
    }
  ]
}