{
  "slug": "crazy-mountain-100",
  "lastUpdated": "2026-02-01T20:59:07.170Z",
  "summary": "The Crazy Mountain 100 is a grueling point-to-point ultramarathon that traverses the rugged and remote Crazy Mountain Range in south-central Montana. Challenging runners with over 23,000 feet of climbing, the course features technical high-alpine terrain including scree fields, high-altitude ridges, and sections with no established trail.",
  "uniqueFeatures": [
    "Exclusive Private Access: The race traverses four multi-generational cattle ranches, providing runners with a rare opportunity to cross private lands that are strictly off-limits to the public at all other times of the year.",
    "Off-Trail Navigation: A significant portion of the course is classified as 'no track,' requiring athletes to navigate through the wilderness using only cairns, ridgelines, and GPS coordinates rather than established trails.",
    "High-Altitude Cowboy Logistics: Embodying its Montana ranching roots, the race features remote aid stations where all supplies are horse-packed in, and top finishers are awarded custom-made palm leaf cowboy hats."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.irunfar.com/legendary-aid-stations-cow-camp-at-the-crazy-mountain-100-mile",
      "title": "Legendary Aid Stations: Cow Camp at the Crazy Mountain 100 Mile",
      "type": "article",
      "source": "iRunFar",
      "summary": "A deep dive into the remote Cow Camp aid station, which is supplied by horse and mule teams to support runners deep in the Montana backcountry.",
      "years": [
        2025
      ],
      "contentSummary": "An editorial piece profiling the Cow Camp aid station at the Crazy Mountain 100 Mile in Montana. The article highlights the remote backcountry setting where volunteers use horse and mule teams to pack in over 1,000 pounds of supplies to support runners at miles 33 and 55 of the race.",
      "qualityScore": 8,
      "tags": [
        "Legendary Aid Stations",
        "Crazy Mountain 100 Mile",
        "Montana",
        "Ultramarathon",
        "Aid Stations"
      ],
      "racers": [
        {
          "firstName": "Andy",
          "lastName": "Jones-Wilkins"
        },
        {
          "firstName": "Stuart",
          "lastName": "Chutter"
        }
      ]
    },
    {
      "url": "https://www.trailrunner.com/trail-news/crazy-mountain-100-promotes-indigenous-respect-and-bipoc-inclusion/",
      "title": "Crazy Mountain 100 Promotes Indigenous Respect and BIPOC Inclusion",
      "type": "interview",
      "source": "Trail Runner Magazine",
      "summary": "A profile on race director Megan DeHaan and the event's mission to bridge the gap between landowners, the Forest Service, and the Indigenous history of the Apsáalooke people.",
      "years": [
        2021
      ],
      "contentSummary": "An interview with race director Megan DeHaan regarding the inaugural Crazy Mountain 100 in Montana, focusing on its mission of BIPOC inclusion and respect for Indigenous lands. The discussion covers the race's partnership with Moun10 Ultra to provide race entries and coaching for diverse athletes, alongside insights from Indigenous runner Scott Flatlip on how events can better acknowledge ancestral territories and foster genuine representation.",
      "qualityScore": 8,
      "tags": [
        "Interview",
        "BIPOC Inclusion",
        "Indigenous Rights",
        "Diversity",
        "Montana",
        "Race Director Profile",
        "Social Issues"
      ],
      "racers": [
        {
          "firstName": "Megan",
          "lastName": "DeHaan"
        },
        {
          "firstName": "Scott",
          "lastName": "Flatlip"
        },
        {
          "firstName": "Tayte",
          "lastName": "Pollmann"
        }
      ]
    }
  ]
}