{
  "slug": "white-lake-ultras",
  "lastUpdated": "2026-02-01T20:55:51.502Z",
  "summary": "Held at White Lake State Park in Tamworth, New Hampshire, the White Lake Ultras is a festive endurance event featuring 6, 12, and 24-hour timed races. Runners navigate a scenic 2-mile single-track loop that winds through forested lakefront trails and sandy shorelines, offering a high-energy 'party' atmosphere ideal for both seasoned athletes and beginners.",
  "uniqueFeatures": [
    "Beachside Start and Finish: The race course prominently features a start and finish line on the beach, allowing runners to transition from forested single-track trails to sandy lakefront 'beach vibes' every two miles.",
    "Costume-Friendly Festive Atmosphere: Unlike more somber mountain races, this event highly encourages costumes and fosters a social environment where runners and crews can camp on-site and celebrate throughout the weekend.",
    "Highly Accessible PR Course: With only 50 feet of vertical ascent per loop and a focus on a short, technical-friendly trail, it is specifically designed for runners looking to set personal distance records in a supported, looped format."
  ],
  "media": [
    {
      "url": "https://podcasts.apple.com/us/podcast/white-lake-ultras-preview-white-mountain-endurance-podcast/id1553531238?i=1000654316335",
      "title": "White Lake Ultras Preview | White Mountain Endurance Podcast",
      "type": "podcast",
      "source": "White Mountain Endurance Podcast",
      "summary": "An in-depth interview with the race organization covering the course layout, expected conditions, and the competitive field for the 6, 12, and 24-hour timed events.",
      "years": [
        2025
      ],
      "contentSummary": "This podcast episode from the White Mountain Endurance Podcast provides a comprehensive preview and guide for the White Lake Ultras race.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://teamrunrun.com/white-lakes-ultra-race-report-robert-h/",
      "title": "White Lakes Ultra Race Report - Robert H",
      "type": "article",
      "source": "Team RunRun",
      "summary": "A long-form personal race profile and report providing timeless logistical advice and a qualitative guide to the technicality of the single-track course for future participants.",
      "years": [
        2019
      ],
      "contentSummary": "Robert Hanna reports on his first 50-mile finish at the White Lakes Ultra in Tamworth, NH, sharing details on the well-organized loop course, aid station highlights like grilled cheese, and logistical tips for future runners.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Robert",
          "lastName": "Hanna"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=kYJqB4Y_X4E",
      "title": "White Lake Ultras Preview | White Mountain Endurance Podcast",
      "type": "podcast",
      "source": "Aravaipa Running",
      "summary": "An in-depth interview with race director Marylyn Styles covering the event's history, its 'beach vibes' and 'Margaritaville' reputation, and detailed insights into the technical segments of the loop.",
      "years": [
        2025
      ],
      "contentSummary": "This podcast episode provides a dedicated preview of the White Lake Ultras, likely covering course details and event expectations for participants.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}