{
  "slug": "tahqua-trail-run",
  "lastUpdated": "2026-02-01T20:59:41.140Z",
  "summary": "The Tahqua Trail Run is a premier wilderness ultramarathon in Michigan's Upper Peninsula that immerses runners in the rugged beauty of Tahquamenon Falls State Park. Participants navigate a challenging 50K course on technical single-track trails and remote forest roads, culminating in a dramatic finish at one of the largest waterfalls in the eastern United States.",
  "uniqueFeatures": [
    "A spectacular finish line located at the Upper Tahquamenon Falls, the second largest waterfall east of the Mississippi River.",
    "A diverse course through the Tahquamenon River Wilderness featuring rare ecosystems like spruce swales, lush bogs, and old-growth hemlock forests.",
    "The unique opportunity to spot native moose in their natural habitat while traversing the remote sections of the North Country Trail near Camp 10 Lake."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://wanderingmichiganwisconsin.com/tahquamenon-falls-things-to-do/",
      "title": "Tahquamenon Falls Things To Do: The Ultimate Guide",
      "type": "article",
      "source": "Wandering Michigan Wisconsin",
      "summary": "A comprehensive evergreen guide to Tahquamenon Falls State Park that profiles the Tahqua Trail Run as a key destination event for trail runners visiting the Upper Peninsula.",
      "years": [
        2023,
        2025
      ],
      "contentSummary": "A comprehensive travel guide to Tahquamenon Falls State Park detailing 17 activities including visiting the Upper and Lower Falls, hiking 35 miles of trails, and participating in seasonal destination events such as the Tahqua Trail Run and the Two-Hearted Trail Run.",
      "qualityScore": 7,
      "tags": [
        "Travel Guide",
        "Tahquamenon Falls",
        "Trail Running",
        "Hiking",
        "Michigan",
        "Upper Peninsula",
        "Race Preview",
        "Event Listing"
      ],
      "racers": []
    }
  ]
}