{
  "raceId": 128954,
  "lastUpdated": "2026-01-31T08:42:10.332Z",
  "gpx": {
    "128954": {
      "url": "https://caltopo.com/m/0P209",
      "source": "caltopo"
    }
  },
  "summary": "The Crazy Mountain 100 is a grueling point-to-point ultramarathon that traverses the jagged, technical terrain of Montana’s 'Angry Mountains,' reaching altitudes over 10,000 feet. This Hardrock and Western States qualifier is renowned for its remote 'old-school' feel, featuring over 23,000 feet of vertical gain and exclusive access to private ranch lands typically closed to the public.",
  "uniqueFeatures": [
    "Offers exclusive, race-day-only access to four private cattle ranches and ancestral Crow Nation territory that are otherwise inaccessible to the public.",
    "Features a massive 23,000+ feet of vertical gain across rugged terrain where runners must occasionally navigate without a trail by following cairns and ridgelines.",
    "Maintains a unique 'Wild West' atmosphere with aid stations supplied by horses and a finish line hosted at the historic Berg Ranch in Lennep."
  ],
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=prv2igD1WZo",
      "title": "Crazy Mountain 100 - The Most Beautiful Race in America",
      "rank": 1,
      "reason": "A cinematic short film following a runner's journey through the race, showcasing the raw beauty and reality of ultrarunning."
    },
    {
      "url": "https://www.youtube.com/watch?v=agH3UL23aXg",
      "title": "Crazy Mountain 100 2025",
      "rank": 2,
      "reason": "Full story of the 2025 race featuring 100 miles of raw footage through remote terrain with over 20,000 feet of climbing."
    },
    {
      "url": "https://www.youtube.com/watch?v=MMoxoUp1sJo",
      "title": "CRAZY MOUNTAIN 100 - The Hardest 100 Miler in the US?",
      "rank": 3,
      "reason": "Documents a pacer's experience at the 2023 race, showcasing the incredible views and technical terrain near Bozeman, Montana."
    },
    {
      "url": "https://www.youtube.com/watch?v=0gg6Ym4tS78",
      "title": "CRAZY MOUNTAIN 100 | Awaxaawippíia",
      "rank": 4,
      "reason": "Ultra Kraut Running's coverage of the race, featuring the stunning mountain scenery and challenging course."
    },
    {
      "url": "https://www.youtube.com/watch?v=-VpPnPyLYb8",
      "title": "Crazy Mountain 100 miler 2024",
      "rank": 5,
      "reason": "Andy Glaze's personal footage from the 2024 race showing the actual course conditions and runner experience."
    }
  ],
  "videoInsights": {
    "challengingSections": [
      "The Big Timber Creek ascent featuring extremely steep and loose scree fields",
      "The Trespass Creek drainage with significant vertical gain and technical footing",
      "High altitude ridge lines that offer zero protection from wind or sun",
      "The long, punishing descent into the final aid stations that tests quad endurance"
    ],
    "proTips": [
      "Use heavy-duty trekking poles for the 22,000+ feet of vertical gain and technical descents",
      "Prioritize heat management using ice bandanas or buff cooling at every water crossing",
      "Train specifically on loose talus and off-trail terrain to prepare for the lack of groomed trails",
      "Maintain a conservative pace in the first 30 miles to mitigate altitude sickness risks",
      "Switch to liquid nutrition if the altitude suppresses your appetite in the high basins",
      "Carry extra socks and gaiters to prevent grit and volcanic ash from causing blisters"
    ],
    "courseHighlights": [
      "The stunning turquoise waters of Blue Lake and Granite Lake",
      "Breathtaking 360-degree views from the exposed mountain passes and ridges",
      "The unique jagged skyline of the Crazy Mountains rarely seen by the public",
      "Running through private ranch lands and pristine wilderness areas"
    ],
    "dnfRisks": [
      "Severe altitude sickness due to the course remaining consistently at high elevations",
      "Dehydration and heat exhaustion on the highly exposed southern-facing climbs",
      "Foot failure or extreme blistering caused by the constant technicality and grit in shoes"
    ]
  },
  "media": [
    {
      "url": "https://www.irunfar.com/legendary-aid-stations-cow-camp-at-the-crazy-mountain-100-mile",
      "title": "Legendary Aid Stations: Cow Camp at the Crazy Mountain 100 Mile",
      "type": "article",
      "source": "iRunFar",
      "summary": "This article highlights the remote Cow Camp aid station, which requires horses and mules to pack in supplies for runners in the backcountry of the Crazy Mountains."
    },
    {
      "url": "https://www.irunfar.com/this-week-in-running-july-28-2025",
      "title": "This Week In Running: July 28, 2025",
      "type": "news",
      "source": "iRunFar",
      "summary": "A results summary of the 2025 Crazy Mountain 100, featuring winners Brandon Benefield and Cassi Knight who navigated the grueling 23,000-foot vertical gain."
    },
    {
      "url": "https://podcasts.apple.com/us/podcast/episode-25-built-in-butte-grit-and-growth-with-the/id1652758253?i=1000654992523",
      "title": "Episode 25: Built in Butte; Grit and Growth with The Montana Maverick Dylan Malloy",
      "type": "podcast",
      "source": "The Run Shoe Diaries Podcast",
      "summary": "Host Luis interviews three-time Crazy Mountain 100 finisher Dylan Malloy about his resilience and the mindset needed to tackle Montana's rugged terrain."
    },
    {
      "url": "https://alpinebaking.com/2024/08/09/crazy-mountain-100-miler/",
      "title": "Crazy Mountain 100 Miler: 2024 Race Report",
      "type": "article",
      "source": "Alpine Baking",
      "summary": "A detailed first-hand account of the 2024 race covering the technical scree fields, creek crossings, and the point-to-point finish at the Berg Ranch."
    },
    {
      "url": "https://rss.com/podcasts/thetraillifepodcast/1120027/",
      "title": "Megan Dehaan and the Crazy Mountain 100",
      "type": "podcast",
      "source": "The Trail Life Podcast",
      "summary": "Race Director Megan Dehaan discusses the humble beginnings of the race and its unique status as one of Montana's premiere Western States Qualifiers."
    },
    {
      "url": "https://teamrunrun.com/crazy-mountain-100-race-report-ben-brones/",
      "title": "Crazy Mountain 100 Race Report - Ben Brones",
      "type": "article",
      "source": "Team RunRun",
      "summary": "Runner Ben Brones provides a comprehensive report on the 2023 race, detailing the unpredictable Montana weather and tips for managing the high-altitude terrain."
    }
  ]
}