{
  "slug": "antelope-canyon-x-half-marathon",
  "lastUpdated": "2026-02-01T20:55:24.254Z",
  "summary": "The Antelope Canyon X Half Marathon is a rugged 13.9-mile trail run held on Navajo Nation land near Page, Arizona, offering a rare opportunity to race through the secluded slot canyons of Canyon X. Combining deep desert sand with technical bouldering and narrow sandstone crevices, the event provides a culturally immersive experience that begins with a traditional Dine prayer and corn pollen ceremony at sunrise.",
  "uniqueFeatures": [
    "Technical Slot Canyon Navigation: Unlike standard road races, the course requires runners to navigate shoulder-width crevices and use ropes and ladders to scramble through the narrowest sections of the canyon.",
    "Cultural Immersion Rituals: The race is deeply rooted in Navajo heritage, featuring a traditional prayer and historical storytelling by race director Harold Bennally at the start line.",
    "Handcrafted Artisan Awards: Finishers receive custom-made silver bracelets adorned with authentic Sleeping Beauty and Kingman turquoise rather than traditional mass-produced medals."
  ],
  "media": [
    {
      "url": "https://www.trailrunnermag.com/people/culture/the-antelope-canyon-x-half-marathon-is-about-more-than-the-numbers/",
      "title": "The Antelope Canyon X Half Marathon is About More Than The Numbers",
      "type": "article",
      "source": "Trail Runner Magazine",
      "summary": "This editorial feature explores the cultural significance of the race as a community-focused event on Navajo land, highlighting race director Harold Bennally's vision and the spiritual connection between the runners and the slot canyon terrain.",
      "years": [
        2023
      ],
      "contentSummary": "This article explores the cultural significance and community impact of the Antelope Canyon X Half Marathon, highlighting race director Harold Bennally’s mission to honor Navajo heritage and provide a unique spiritual experience on ancestral land.",
      "qualityScore": 9,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Harold",
          "lastName": "Bennally"
        },
        {
          "firstName": "Sergio",
          "lastName": "Avila"
        },
        {
          "firstName": "Jofauna",
          "lastName": "Shorty"
        }
      ]
    },
    {
      "url": "https://www.irunfar.com/verna-volker-and-native-women-running",
      "title": "Verna Volker and Native Women Running",
      "type": "article",
      "source": "iRunFar",
      "summary": "A profile of activist Verna Volker that discusses the emotional and ancestral impact of running the Antelope Canyon X Half Marathon.",
      "years": [
        2023
      ],
      "contentSummary": "An in-depth profile of Verna Volker, the founder of Native Women Running, detailing her personal running journey and the creation of her community organization for Indigenous women.",
      "qualityScore": 9,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Verna",
          "lastName": "Volker"
        }
      ]
    }
  ]
}