{
  "slug": "shawnee-hills-trail-races",
  "lastUpdated": "2026-02-01T20:59:53.593Z",
  "summary": "The Shawnee Hills Trail Races immerse runners in the rugged wilderness of Southern Illinois' Shawnee National Forest, with distances ranging from a half marathon to a grueling 100-miler. Starting at the historic Camp Ondessonk, the course traverses deep sandstone canyons and dense oak-hickory forests while challenging athletes with intense summer humidity and highly technical terrain.",
  "uniqueFeatures": [
    "Scenic Waterfall Route: The course passes several stunning waterfalls, including Pakentuck Falls, which is the tallest free-falling waterfall in the state of Illinois.",
    "Rustic Treehouse Accommodations: Runners and families can stay in 'one-star luxury' at Camp Ondessonk, featuring open-air treehouses that offer a unique outdoor immersion without the hassle of traditional camping.",
    "Technical Sandstone Canyons: Unlike typical rolling Midwestern trails, this race is known for its technicality, featuring rocky 'ankle-breaker' paths and narrow passages through the Shawnee Hills Natural Division canyon systems."
  ],
  "media": [
    {
      "url": "https://ultrarunning.com/featured/shawnee-hills-back-in-action/",
      "title": "Shawnee Hills: Back in Action",
      "type": "article",
      "source": "UltraRunning Magazine",
      "summary": "A detailed narrative profile and race report that explores the technicality of the Shawnee National Forest course, highlighting its figure-eight loops, creek crossings, and the challenging heat and humidity of southern Illinois.",
      "years": [
        2018
      ],
      "contentSummary": "Susan Donnelly provides a first-person narrative of her experience at the Shawnee Hills 100-miler, her comeback race following hip surgery. The report describes the figure-eight loop course in Shawnee National Forest, highlighting the technical terrain, the scenic Jackson Falls section, and the extreme humidity that led to a low finishing rate. Donnelly finished as the second female in 30:53:33.",
      "qualityScore": 8,
      "tags": [
        "Race Report",
        "Ultramarathon",
        "Shawnee Hills 100",
        "Trail Running",
        "Results"
      ],
      "racers": [
        {
          "firstName": "Susan",
          "lastName": "Donnelly"
        },
        {
          "firstName": "EJ",
          "lastName": "Arroyo"
        }
      ]
    },
    {
      "url": "https://terrain-mag.com/race-report-shawnee-hills-100/",
      "title": "Race Report: Shawnee Hills 100",
      "type": "article",
      "source": "Terrain Magazine",
      "summary": "An editorial feature on the inaugural event that defines the race's 'Heepwah' spirit and provides a comprehensive look at the 33-mile figure-eight course layout and the rugged sandstone canyon terrain.",
      "years": [
        2017
      ],
      "contentSummary": "A first-hand account of the inaugural Shawnee Hills 100, 100k, and 50k races held at Camp Ondessonk in the Shawnee National Forest. The report highlights the challenging 33-mile figure-eight course, characterized by technical sandstone terrain and gravel, the 'Heepwah' spirit of the event community, and key performances across all distances including Emily Bello's overall win in the 100-mile race.",
      "qualityScore": 8,
      "tags": [
        "Race Report",
        "100-miler",
        "100k",
        "50k",
        "Trail Running",
        "Results",
        "Shawnee National Forest"
      ],
      "racers": [
        {
          "firstName": "Tim",
          "lastName": "Landewe"
        },
        {
          "firstName": "Emily",
          "lastName": "Bello"
        },
        {
          "firstName": "Todd",
          "lastName": "Bello"
        },
        {
          "firstName": "Michael",
          "lastName": "Eriks"
        },
        {
          "firstName": "Paul",
          "lastName": "Geist"
        },
        {
          "firstName": "Brandon",
          "lastName": "Sullivan"
        },
        {
          "firstName": "Shannon",
          "lastName": "Chehade"
        },
        {
          "firstName": "Zdenek",
          "lastName": "Palecek"
        },
        {
          "firstName": "Mary",
          "lastName": "Nienaber"
        },
        {
          "firstName": "Katie",
          "lastName": "O'Donnell"
        },
        {
          "firstName": "Dale",
          "lastName": "Leonard"
        }
      ]
    },
    {
      "url": "https://dizruns.com/laura-range/",
      "title": "Laura Range Is Always Working To Make Trail Running Inclusive For All",
      "type": "podcast",
      "source": "Diz Runs",
      "summary": "An evergreen interview with the co-race director that delves into the philosophy behind the Shawnee Hills Trail Races and the commitment to making ultramarathons accessible and inclusive for all runners.",
      "years": [
        2022
      ],
      "contentSummary": "An interview with runner and race director Laura Range about her 15-year journey in ultrarunning, her experience managing races like the Shawnee Hills 100 and Arrowhead Endurance Run, and her commitment to making the sport inclusive for runners of all abilities. The content covers her transition from 5ks to 100-milers, her pursuit of FKTs during the pandemic, and her philosophy on trail maintenance and runner safety.",
      "qualityScore": 8,
      "tags": [
        "Interview",
        "Podcast",
        "Ultrarunning",
        "Race Directing",
        "Inclusion",
        "FKT",
        "Shawnee Hills 100"
      ],
      "racers": [
        {
          "firstName": "Laura",
          "lastName": "Range"
        },
        {
          "firstName": "Mirna",
          "lastName": "Valerio"
        },
        {
          "firstName": "Gene",
          "lastName": "Gurkoff"
        },
        {
          "firstName": "Pete",
          "lastName": "Coser"
        }
      ]
    }
  ]
}