{
  "slug": "grand-island",
  "lastUpdated": "2026-02-01T20:59:20.263Z",
  "summary": "The Grand Island Trail Run is a breathtaking ultramarathon held on a remote wilderness island in Michigan's Lake Superior, featuring a 50K course that circles the island's rugged perimeter. Runners encounter a stunning variety of terrain, from 300-foot sandstone cliffs and white sand beaches to dense old-growth hardwood forests with views of the Pictured Rocks National Lakeshore.",
  "uniqueFeatures": [
    "Island Access Logistics: The race takes place on a non-motorized island reachable only by ferry, creating a secluded and immersive wilderness experience for a limited field of 500 runners.",
    "Dramatic Coastal Views: Much of the course is perched atop 300-foot-high Jacobsville sandstone cliffs, offering participants constant, wide-angle views of the crystal-clear waters of Lake Superior.",
    "Eco-Sustainable Design: As a cupless and eco-conscious event, the race mandates that runners carry their own hydration systems to protect the island's pristine ecosystem while navigating through its diverse inland and coastal trails."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.runnersworld.com/runners-stories/a20835008/a-marathon-sized-island/",
      "title": "A Marathon-Sized Island",
      "type": "article",
      "source": "Runner's World",
      "summary": "An editorial reflection on the unique experience of running the Grand Island Trail Marathon, highlighting the remote wilderness and the logistical charm of a ferry-access race.",
      "years": [
        2016
      ],
      "contentSummary": "Robert James Reese provides a personal race report of the Grand Island Trail Marathon in Michigan's Upper Peninsula. The narrative covers the logistical challenges of traveling with a toddler, the scenic yet demanding trail features like Lake Superior beaches and steep hills, and a notable encounter with a hornet's nest at mile six.",
      "qualityScore": 7,
      "tags": [
        "Race Report",
        "Trail Running",
        "Marathon Training",
        "Grand Island Trail Marathon"
      ],
      "racers": [
        {
          "firstName": "Robert",
          "lastName": "Reese"
        },
        {
          "firstName": "Jeff",
          "lastName": "Dengate"
        }
      ]
    }
  ]
}