{
  "slug": "the-cherokee",
  "lastUpdated": "2026-02-01T20:58:56.673Z",
  "summary": "The Cherokee is a premier mountain ultramarathon held in Tellico Plains, Tennessee, that takes runners through the technical terrain and dense wilderness of the Cherokee National Forest. Spanning distances up to 130K with over 19,000 feet of elevation gain, it is a grueling 'rite of passage' that tests physical grit against a backdrop of ancient Appalachian history.",
  "uniqueFeatures": [
    "Historic Path-Running: The course traverses culturally significant routes including the John Muir Trail and the Unicoi Turnpike, a historic pathway used during the Trail of Tears.",
    "The Waucheesi Ascent: Runners must conquer the brutal climb to the Waucheesi Tower, a section so notorious for its verticality that it inspired the race's unofficial mantra: 'Waucheesi ain’t easy.'",
    "Lantern-Lit Night Oases: To guide 130K participants through the darkness, remote aid stations are transformed into lantern-lit sanctuaries offering warm food, firelight, and mountain hospitality."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://anchor.fm/dirtandvert/episodes/Grit-and-Glory-Katti-Jacksons-Ultra-Running-Adventures-e2j8hjk",
      "title": "Grit and Glory: Katti Jackson's Ultra Running Adventures",
      "type": "podcast",
      "source": "Dirt and Vert Podcast",
      "summary": "An interview with course record holder Katti Jackson, discussing her victory at The Cherokee 70K and providing insights into the technical challenges of the terrain.",
      "years": [
        2024
      ],
      "contentSummary": "A podcast interview with ultra runner Katti Jackson discussing her experiences and the challenges she has faced in the sport.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Katti",
          "lastName": "Jackson"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=A8vNis6K7XU",
      "title": "Matt Cook: A Story of Hope and Determination",
      "type": "interview",
      "source": "Dirt & Vert Podcast",
      "summary": "A deep-dive interview with the winner of The Cherokee 70K, focusing on his recovery from illness and his experience navigating the technical trails of the Cherokee National Forest.",
      "years": [
        2024
      ],
      "contentSummary": "An inspirational profile exploring the personal journey and resilience of athlete Matt Cook.",
      "qualityScore": 6,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Matt",
          "lastName": "Cook"
        }
      ]
    }
  ]
}