{
  "slug": "ram-party",
  "lastUpdated": "2026-02-01T20:56:29.894Z",
  "summary": "The Ram Party is a high-altitude trail running festival based in Colorado Springs, headlined by a challenging 55-mile ultramarathon that traverses iconic local landmarks. Runners climb from the foothills through the red rock formations of Garden of the Gods to the subalpine terrain of Rampart Reservoir, finishing with a festive 'party' atmosphere at a historic bicycle-themed resort.",
  "uniqueFeatures": [
    "Historic Road Ascent: The course features a relentless 19.5-mile sustained climb up Rampart Range Road, a historic route built in the 1930s by the Civilian Conservation Corps that reaches an elevation of nearly 9,500 feet.",
    "Garden of the Gods Passage: Unlike most mountain ultras, the race begins by navigating through the world-famous Garden of the Gods park, taking runners past massive sandstone formations like Balanced Rock.",
    "Bicycle-Themed Basecamp: The event is headquartered at the Buffalo Lodge Bicycle Resort, a historic motor lodge that provides a unique community-centric finish line featuring live music, karaoke, and a dedicated 'Ram Party' celebration."
  ],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=Xh0Y-X7S5yI",
      "title": "Running Your First 50 Mile Ultra (Ram Party 50 Mile) | Trail Talk 60",
      "type": "podcast",
      "source": "Trail Talk",
      "summary": "An in-depth video discussion serving as a course walkthrough and preparation guide for runners tackling the Colorado Front Range terrain.",
      "years": [
        2022
      ],
      "contentSummary": "An episode of Trail Talk providing insights and advice on preparing for and running the Ram Party 50 Mile ultramarathon.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://www.youtube.com/watch?v=N_2H9YvWlqI",
      "title": "Running Your First 50 Mile Ultra (Ram Party 50 Mile) | Trail Talk 60",
      "type": "podcast",
      "source": "Trail Talk",
      "summary": "A deep-dive interview and discussion regarding the race experience, technical terrain features, and the mental game of the Ram Party 50-miler.",
      "years": [
        2022
      ],
      "contentSummary": "This episode of Trail Talk discusses the experience and logistics of completing a first 50-mile ultramarathon at the Ram Party 50 Mile race.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": []
    }
  ]
}