{
  "slug": "coyote-ugly-30k-50k",
  "lastUpdated": "2026-02-01T20:52:14.922Z",
  "summary": "The Coyote Ugly 30k & 50k is a rugged trail ultramarathon set in the Cohutta Wilderness of Ellijay, Georgia, starting and finishing at the renowned Mulberry Gap Adventure Basecamp. Participants navigate the challenging Pinhoti and Bear Creek trails, facing over 4,400 feet of elevation gain for the 50k distance amidst scenic waterfalls and multiple creek crossings.",
  "uniqueFeatures": [
    "The race features a highly progressive two-year pregnancy deferral policy, allowing female athletes more flexibility in their training and competition schedules.",
    "Runners experience iconic Georgia trail sections including the Pinhoti Trail and the Bear Creek loop, passing natural landmarks such as Barnes Creek Falls and the Bear Creek overlook.",
    "The event is headquartered at Mulberry Gap, a specialized 'adventure basecamp' known for its mountain biking culture, providing a unique community atmosphere and high-end aid station fare like avocado tortillas and grilled cheese."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.bigpeachrunningco.com/ep-141-the-big-peach-ride-run-podcast-with-guest-vanessa-faye-foerster/",
      "title": "Mental Endurance and Georgia Trail Racing",
      "type": "podcast",
      "source": "The Big Peach Ride + Run Podcast",
      "summary": "This episode discusses the Coyote Ugly 30k/50k as a key event for building mental endurance and preparing for major mountain marathons.",
      "years": [
        2024
      ],
      "contentSummary": "Host Dave Martinez interviews mental endurance coach Vanessa Faye Foerster about overcoming psychological barriers in training and highlights upcoming regional events like the Helenback Trail Marathon.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Vanessa Faye",
          "lastName": "Foerster"
        },
        {
          "firstName": "Dave",
          "lastName": "Martinez"
        }
      ]
    },
    {
      "url": "https://podcasters.spotify.com/pod/show/dirtandvert/episodes/Coyote-Ugly-Racing-Mariah-Fields-Passion-for-Trails-e2r5p9g",
      "title": "Coyote Ugly Racing: Mariah Fields' Passion for Trails",
      "type": "podcast",
      "source": "Dirt and Vert Podcast",
      "summary": "An in-depth interview with the Race Director of Coyote Ugly Racing discussing the race's origins, the difficulty of the North Georgia mountain climbs, and the inclusive community atmosphere of the event.",
      "years": [
        2025
      ],
      "contentSummary": "In this podcast episode, Mariah Fields shares her journey into trail running and her involvement with the Coyote Ugly Racing community.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Mariah",
          "lastName": "Fields"
        }
      ]
    }
  ]
}