{
  "raceId": 127081,
  "lastUpdated": "2026-02-01T20:57:21.008Z",
  "summary": "The Mill Stone 50K is a rugged trail ultramarathon held at the Anne Springs Close Greenway in Fort Mill, South Carolina, consisting of three challenging 10.5-mile loops through a 2,100-acre private nature preserve. Managed by the Rock Hill Striders, this technical race eschews paved paths for single-track trails, creek crossings, and rolling Piedmont terrain.",
  "uniqueFeatures": [
    "The Sacred Mill Stone: Runners pass the original granite millstone from Webb's Mill and are traditionally 'strongly encouraged' to touch the stone for good luck, a ritual central to the local running community.",
    "Technical Loop Terrain: The course is notoriously muddy and technical, featuring narrow single-track trails, replaced suspension bridges, and at least two significant creek crossings per loop.",
    "Spectator-Friendly Hub: The multi-loop format centers around the high-energy Rush Pavilion at Lake Haigler, where spectators can enjoy food and craft beer from the Gateway Canteen while cheering for runners three separate times."
  ],
  "media": [
    {
      "url": "https://irunfar.com/this-week-in-running-february-10-2025",
      "title": "This Week In Running: February 10, 2025",
      "type": "news",
      "source": "iRunFar",
      "summary": "This editorial recap features the 2025 Mill Stone 50K results, highlighting John Olar and Heidi Sides as the top male and female finishers.",
      "years": [
        2025
      ],
      "contentSummary": "This editorial column provides a comprehensive recap of trail and ultra race results for the week of February 10, 2025, with a primary focus on the Black Canyon 100k.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Justin",
          "lastName": "Mock"
        },
        {
          "firstName": "Zach",
          "lastName": "Miller"
        },
        {
          "firstName": "Meghan",
          "lastName": "Hicks"
        },
        {
          "firstName": "Bryon",
          "lastName": "Powell"
        },
        {
          "firstName": "Andy",
          "lastName": "Jones-Wilkins"
        }
      ]
    },
    {
      "url": "https://irunfar.com/this-week-in-running-february-12-2024",
      "title": "This Week In Running: February 12, 2024",
      "type": "news",
      "source": "iRunFar",
      "summary": "The article reports on the 2024 race results where Drew Marshall set a new course record and Louise Hindal Acer took the women's victory.",
      "years": [
        2024
      ],
      "contentSummary": "A comprehensive weekly recap of major trail and ultramarathon events, featuring results from the 2024 Black Canyon 100k, Tarawera Ultra, and Jackpot Ultrarunning Festival.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Hayden",
          "lastName": "Hawks"
        },
        {
          "firstName": "Heather",
          "lastName": "Jackson"
        },
        {
          "firstName": "Ruth",
          "lastName": "Croft"
        },
        {
          "firstName": "Daniel",
          "lastName": "Jones"
        },
        {
          "firstName": "Jupiter",
          "lastName": "Carera"
        }
      ]
    }
  ]
}