{
  "slug": "crown-of-the-crest",
  "lastUpdated": "2026-02-01T18:31:17.236Z",
  "summary": "Held at the Calvin Crest camp near Fremont, Nebraska, Crown of the Crest is a demanding multi-distance trail event that transforms the typically flat Midwestern landscape into a technical 'roller coaster' of bluff-side running. Athletes tackle a 10-mile single-track loop along the Platte River, navigating dense cedar ridges and significant elevation changes that test both grit and technical skill.",
  "uniqueFeatures": [
    "The 'Lucky 13' timed event starts at 1:00 AM on Sunday, specifically designed for fresh runners to join the course and provide a psychological boost to 100-mile participants during their final hours.",
    "The 'Double Crown' Challenge offers a unique back-to-back endurance test where participants complete a full marathon on Saturday followed by a half marathon on Sunday morning.",
    "The course features roughly 900 feet of elevation gain per 10-mile loop, including technical switchbacks and root-heavy sections rarely found in the surrounding Nebraska plains."
  ],
  "videos": [
    {
      "url": "https://www.youtube.com/watch?v=-TTFt9grIu0",
      "title": "Sarah Dramis Triple Crown Hiker, Personal Trainer & Ultrarunner. Tells her Remarkable Story!!!",
      "channelTitle": "Beyond the Buckets Podcast with Chris McSwain",
      "publishedYear": 2020
    }
  ],
  "media": [
    {
      "url": "https://runemu.com/event/crown-of-the-crest-1-2-marathon-100m-may-23-2026-fremont-ne/",
      "title": "Crown of the Crest (1/2 Marathon-100M) Race Profile",
      "type": "article",
      "source": "RunEmu",
      "summary": "A comprehensive race profile describing the 10-mile single-track loop on the Platte River bluffs, featuring technical 'roller coaster' climbs and roots.",
      "years": [
        2026
      ]
    },
    {
      "url": "https://joshtweeterson.substack.com/p/101-scott-breeden",
      "title": "Chasing Three Hours: Scott Breeden and the GOATz Community",
      "type": "podcast",
      "source": "Chasing Three Hours",
      "summary": "An interview with Scott Breeden discussing his journey into ultrarunning and his involvement with the GOATz, the organization that hosts the Crown of the Crest.",
      "years": [
        2024
      ]
    },
    {
      "url": "https://dizruns.com/deb-bahr/",
      "title": "Diz Runs Radio: The Nebraska Trail Scene and GOATz Culture",
      "type": "podcast",
      "source": "DizRuns Radio",
      "summary": "An evergreen conversation about the Omaha trail running community, highlighting the supportive atmosphere of the club behind the Crown of the Crest ultramarathon.",
      "years": [
        2023
      ]
    }
  ]
}