{
  "slug": "grasslands-trail-run",
  "lastUpdated": "2026-02-01T20:53:21.521Z",
  "summary": "Since 1999, the Grasslands Trail Run has challenged athletes within the 20,000-acre Lyndon B. Johnson National Grasslands of North Texas. This scenic event features a fast, runnable course through rolling hills and post oak savannas, offering distances ranging from a 15K to a premier 100-mile ultramarathon.",
  "uniqueFeatures": [
    "Cloverleaf Course Layout: The race utilizes a central hub at TADRA Point, where runners complete four distinct loops in a cloverleaf pattern, allowing them to return to their crew and the main aid station multiple times.",
    "Active Grazing Terrain: Participants run through active livestock pastures and must navigate gates throughout the course, giving rise to the event's famous rule and motto: 'Don't let the cows out!'",
    "Extensive Trail Variety: The course boasts approximately 45 miles of non-overlapping, multi-use equestrian trails, ensuring that even long-distance runners experience a wide variety of terrain without heavy repetition."
  ],
  "media": [
    {
      "url": "https://dfwrunningtalk.com/people/chris-barnwell/",
      "title": "People - DFW Running Talk: Chris Barnwell",
      "type": "podcast",
      "source": "DFW Running Talk",
      "summary": "A profile on the race director that details the meticulous scouting and GPS mapping required to maintain the 45 miles of unique trails at the LBJ National Grasslands.",
      "years": [
        2024
      ],
      "contentSummary": "This profile details the life and career of Chris Barnwell, from his transformation into an ultra-runner to his role as the founder and director of Blaze Trails Running in Texas.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Chris",
          "lastName": "Barnwell"
        },
        {
          "firstName": "Anne",
          "lastName": "Barnwell"
        },
        {
          "firstName": "Chris",
          "lastName": "Detzel"
        }
      ]
    }
  ]
}