{
  "slug": "the-bootlegger-100-mile-trail-race",
  "lastUpdated": "2026-02-01T20:54:12.939Z",
  "summary": "The Bootlegger 100 Mile Trail Race is a high-energy ultramarathon set in the rolling hills of Flovilla, Georgia, utilizing the scenic single-track trails of Dauset Trails and Indian Springs State Park. Designed to be accessible for first-timers and fast for PR-seekers, the event features a supportive, festive atmosphere with consistent access to specialized aid stations and crew support.",
  "uniqueFeatures": [
    "Eight-Loop Format: The race follows an 8-loop course on a 12.5-mile circuit, providing participants with frequent crew access and a central hub for morale and nutrition throughout the 100-mile journey.",
    "Western States Entry Raffle: As a dedicated sponsor of the Western States Endurance Run, the event offers finishers a unique opportunity to win a raffle for a guaranteed entry into the world-renowned California race.",
    "400-Mile Club Recognition: In addition to the traditional finisher's belt buckle, runners can aim for the '400 Mile Jacket,' a custom-embroidered award for those who reach that cumulative mileage across the organizer's race series."
  ],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=A_Fsh2X675Y",
      "title": "Pacer Chat: Recapping the Bootlegger 100 with RD Emily Labutta",
      "type": "podcast",
      "source": "Miles With Marty Podcast",
      "summary": "A deep-dive interview with race director Emily Labutta that provides an evergreen look at the event's philosophy, the technical single-track of the Georgia trails, and the logistics of the multi-loop format.",
      "years": [
        2025
      ],
      "contentSummary": "Race Director Emily Labutta recaps the Bootlegger 100, sharing insights and highlights from the event on the Pacer Chat podcast.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Emily",
          "lastName": "Labutta"
        }
      ]
    },
    {
      "url": "https://podcasts.apple.com/us/podcast/episode-143-rosie-gagnon-running-for-dexter/id1535973950?i=1000652678643",
      "title": "Athlete Spotlight: Rosie Gagnon at the Bootlegger 100",
      "type": "podcast",
      "source": "Miles With Marty Podcast",
      "summary": "A deep-dive interview with ultra-endurance athlete Rosie Gagnon following her 91st 100-mile finish at the Bootlegger 100, providing timeless insights into the mental grit and pacing required for the multi-loop Georgia course.",
      "years": [
        2025
      ],
      "contentSummary": "Rosie Gagnon discusses her performance at the Bootlegger 100 and her 'Running for Dexter' campaign in this detailed athlete spotlight podcast interview.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Rosie",
          "lastName": "Gagnon"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=0kI7F1yP6_s",
      "title": "Bootlegger 100: Course Experience and Tactical Guide",
      "type": "article",
      "source": "Pacer Travel / Miles With Marty",
      "summary": "A comprehensive discussion with Race Director Emily Labutta and course timing experts about the tactical challenges of the Bootlegger 100, including night navigation and heat management on the single-track loops.",
      "years": [
        2025
      ],
      "contentSummary": "This tactical guide provides a detailed analysis of the Bootlegger 100 course layout and strategic advice for participants.",
      "qualityScore": 8,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}