{
  "slug": "skunk-ape-100-mile-endurance-run",
  "lastUpdated": "2026-02-01T20:55:42.945Z",
  "summary": "Held in the heart of Ocala, Florida, the Skunk Ape 100 Mile Endurance Run is a scenic out-and-back ultramarathon through the historic Marjorie Harris Carr Cross Florida Greenway. Runners traverse a lush variety of ecosystems, including sand pine scrubs, riverine hardwoods, and prairies, all while chasing a 36-hour cutoff for the coveted finisher's belt buckle.",
  "uniqueFeatures": [
    "The course crosses the first true 'land bridge' in the United States, a massive vegetated wildlife corridor spanning across Interstate 75.",
    "It features the 'highest most southern switchback' in the United States, a rare topographical highlight in the otherwise flat Florida landscape.",
    "The race is themed after the legendary Skunk Ape—Florida's version of Bigfoot—and navigates the Ross Prairie Wildlife Management Area where sightings of the creature are part of local lore."
  ],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=R0kYq_6A8e4",
      "title": "Audri's Skunk Ape 100 Deep Dive",
      "type": "podcast",
      "source": "Where's The Finish Podcast",
      "summary": "A detailed narrative interview exploring the runner's experience, training, and survival strategies for the unique environmental challenges of the Skunk Ape 100-mile course.",
      "years": [
        2024
      ],
      "contentSummary": "An in-depth review and personal race report detailing Audri Loughlin's experience competing in the Skunk Ape 100 ultramarathon.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Audri",
          "lastName": "Loughlin"
        }
      ]
    },
    {
      "url": "https://drive.google.com/file/d/1F0HVIpayWBGsqv5PU7mfZ6qpw0g252u6/view",
      "title": "Skunk Ape 100 Guidebook and Rules",
      "type": "article",
      "source": "Skunk Ape Events",
      "summary": "An evergreen technical course guide providing detailed information on aid stations, course marking protocols, and the unique terrain of the Marjorie Harris Carr Cross Florida Greenway.",
      "years": [
        2024,
        2025,
        2026
      ],
      "contentSummary": "The official guidebook and rules for the Skunk Ape 100, providing runners with comprehensive information on race logistics, course regulations, and safety requirements.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}