{
  "slug": "desert-peak-ultra",
  "lastUpdated": "2026-02-01T20:55:12.152Z",
  "summary": "The Desert Peak Ultra is a grueling mountain race in Oracle, Arizona, that challenges runners with a dramatic ascent from the Sonoran Desert floor to the 9,159-foot alpine summit of Mount Lemmon. Participants navigate a mix of rugged climbs and smooth singletrack trails while experiencing a stunning transition from saguaro-filled landscapes to cool pine forests.",
  "uniqueFeatures": [
    "Sky Island Transition: Runners undergo a rare ecological shift, ascending over 8,000 feet from the heat of the Sonoran Desert into high-altitude alpine pine forests at the summit.",
    "The Summit Challenge: Hardcore athletes can tackle the 'Summit Challenge,' which requires completing both the 100K and 50K races on back-to-back days to summit Mount Lemmon twice.",
    "Ultra-Festival Atmosphere: The event doubles as a trail festival featuring a live DJ, guest speakers, food trucks, and post-race yoga sessions at the Haycreek Ranch start/finish line."
  ],
  "media": [
    {
      "url": "https://www.irunfar.com/ajws-three-wishes-for-ultrarunning-in-2026",
      "title": "AJW’s Three Wishes for Ultrarunning in 2026",
      "type": "article",
      "source": "iRunFar",
      "summary": "Renowned columnist Andy Jones-Wilkins profiles the Desert Peak Ultra as a standout example of the 'mom and pop' grassroots race movement, offering a high-quality alternative to corporate-led events.",
      "years": [
        2026
      ],
      "contentSummary": "In his Taproom column, Andy Jones-Wilkins presents three aspirational wishes for the state and direction of ultrarunning in 2026.",
      "qualityScore": 6,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Jim",
          "lastName": "Walmsley"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=M5yG1Qy2S8A",
      "title": "Desert Peak Ultra 100k & 50k Course Recon",
      "type": "article",
      "source": "Everyday Ultra",
      "summary": "A comprehensive editorial guide and video walkthrough of the course, detailing the ascent of Mount Lemmon and the technical Sonoran Desert singletrack.",
      "years": [
        2024,
        2025
      ],
      "contentSummary": "This video provides a detailed reconnaissance and course preview of the 100k and 50k routes for the Desert Peak Ultra, showcasing the terrain and trail conditions.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}