{
  "slug": "frozen-4-hour-5k-duluth-winter-trail-series",
  "lastUpdated": "2026-02-01T20:50:40.411Z",
  "summary": "The Frozen 4 Hour & 5K serves as the exhilarating finale of the Duluth Winter Trail Series, challenging runners to tackle the snow-packed fat bike trails of Lester Park in the heart of winter. Participants can opt for a single 5K loop or push their limits in a four-hour endurance format where the goal is to bank as many miles as possible before the clock expires.",
  "uniqueFeatures": [
    "Dual-Loop Format: To maximize mileage in the final stretch, the race utilizes a 5K primary loop for the first three hours before switching to a short 0.5-mile secondary loop for the final hour.",
    "Fat Bike Trail Integration: The course is held on Duluth's specialized multi-use fat bike trails, offering a unique, groomed snow surface that provides a different technical challenge than traditional dirt trails.",
    "Series Survivor Award: As the final event in the Duluth Winter Trail Series, finishers who have completed all four seasonal races earn the coveted 'Winter Trail Series Survivor' special award."
  ],
  "media": [
    {
      "url": "https://northernwilds.com/conquering-the-cold-the-duluth-winter-trailrunning-series/",
      "title": "Conquering the Cold: The Duluth Winter Trailrunning Series",
      "type": "article",
      "source": "Northern Wilds Magazine",
      "summary": "A deep-dive feature into the history and philosophy of the race series, featuring interviews with the race director and practical advice for navigating snow-packed fat bike trails.",
      "years": [
        2024
      ],
      "contentSummary": "This article profiles the Duluth Winter Trailrunning Series and race director Andy Holak, providing details on upcoming 2025 events and tips for winter trail running.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": [
        {
          "firstName": "Andy",
          "lastName": "Holak"
        },
        {
          "firstName": "Kim",
          "lastName": "Holak"
        }
      ]
    },
    {
      "url": "https://duluthwintertrailseries.com/frozen-4-hour-race-info/",
      "title": "Frozen 4 Hour Course Guide and Race Rules",
      "type": "article",
      "source": "Duluth Winter Trail Series",
      "summary": "The definitive guide to the multi-loop course format, including specific rules for the final hour and the transition to the short 0.5-mile secondary loop.",
      "years": [
        2024,
        2025,
        2026
      ],
      "contentSummary": "This guide outlines the official rules and course logistics for the Frozen 4 Hour race, detailing the transition from a 5K primary loop to a 0.5-mile secondary loop during the final hour of competition.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}