{
  "slug": "waugoshance-trail-run",
  "lastUpdated": "2026-02-01T20:58:31.701Z",
  "summary": "The Waugoshance Trail Run is a premier point-to-point ultramarathon that traverses the rugged northwestern tip of Michigan's Lower Peninsula, primarily within the pristine Wilderness State Park. Runners navigate a challenging yet scenic route featuring high bluffs overlooking Lake Michigan, dense coastal forests, and serene inland lakes before finishing in historic Mackinaw City.",
  "uniqueFeatures": [
    "The course is over 90% single-track trail, largely following a premier section of the North Country National Scenic Trail.",
    "Participants cross diverse ecological zones including wildflower-blanketed lowlands, pine-needle carpeted forests, and the tranquil Sturgeon Bay Trail.",
    "The event maintains a strong environmental focus, utilizing eco-conscious staging and awarding finishers unique handcrafted hardwood medallions instead of traditional metal medals."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://raceraves.com/races/waugoshance-trail-run/",
      "title": "Waugoshance Trail Run Race Profile & Course Guide",
      "type": "article",
      "source": "RaceRaves",
      "summary": "A comprehensive editorial breakdown of the race course, describing the 90% single-track route from Cross Village to Mackinaw City, including key landmarks like French Farm Lake and Goose Pond.",
      "years": [
        2025
      ],
      "contentSummary": "A detailed course guide for the Waugoshance Trail Run, a 90% single-track race held on Michigan's North Country Trail between Cross Village and Mackinaw City. The content outlines the terrain for the 50K, marathon, and half-marathon distances, including scenic highlights like Lake Michigan bluffs and French Farm Lake, complemented by runner reviews on race organization and difficulty.",
      "qualityScore": 6,
      "tags": [
        "Race Profile",
        "Course Guide",
        "Trail Running",
        "Michigan",
        "50K",
        "Marathon",
        "Half Marathon"
      ],
      "racers": []
    },
    {
      "url": "https://www.irunfar.com/baby-on-board-long-distance-running-during-pregnancy",
      "title": "Baby On Board: Long-Distance Running During Pregnancy",
      "type": "article",
      "source": "iRunFar",
      "summary": "This editorial feature profiles elite runner Michele Yates and highlights her performance at the Waugoshance Trail Marathon as a case study for competitive running in unique circumstances.",
      "years": [
        2017
      ],
      "contentSummary": "A comprehensive scientific review exploring the physiological effects and safety considerations for athletes engaged in long-distance running during pregnancy.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Samantha",
          "lastName": "Gash"
        }
      ]
    },
    {
      "url": "https://www.youtube.com/watch?v=Fj-Y4eW_1D8",
      "title": "Waugoshance Trail Marathon with RD Jeff Crumbaugh",
      "type": "interview",
      "source": "Michigan Runner / YouTube",
      "summary": "A timeless interview with the race director discussing the history, specific wildflower blooms, and the technical single-track nature of the course through Wilderness State Park.",
      "years": [
        2021
      ],
      "contentSummary": "Race Director Jeff Crumbaugh provides an in-depth look at the Waugoshance Trail Marathon, discussing the course and the event experience.",
      "qualityScore": 8,
      "tags": [
        "Preview"
      ],
      "racers": [
        {
          "firstName": "Jeff",
          "lastName": "Crumbaugh"
        }
      ]
    },
    {
      "url": "https://www.halfmarathons.net/michigan-waugoshance-trail-marathon-half-marathon-relay/",
      "title": "Waugoshance Trail Marathon & 50K Course Guide",
      "type": "article",
      "source": "HalfMarathons.net",
      "summary": "A comprehensive editorial guide to the point-to-point course, featuring descriptions of the Sturgeon Bay bluffs, French Farm Lake shoreline, and the unique hardwood medallions awarded to finishers.",
      "years": [
        2024,
        2025
      ],
      "contentSummary": "A comprehensive guide to the Waugoshance Trail Run weekend in Michigan, featuring course details, logistical information, and registration specifics for the 50K, marathon, and half marathon events.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}