{
  "slug": "sugar-badger-50-50-and-half",
  "lastUpdated": "2026-02-01T20:57:03.410Z",
  "summary": "The Sugar Badger 50/50 and Half is a premier trail event in Belleville, Wisconsin, that guides runners through the scenic landscapes of the Badger State and Sugar River rail trails. Known for its flat, soft-surface terrain and 'family reunion' atmosphere, the race is an ideal choice for athletes pursuing personal records or those attempting their first ultra-distance challenge.",
  "uniqueFeatures": [
    "The Stewart Tunnel Experience: A signature 1/4-mile passage through a dark, curved historic tunnel that requires runners to use headlamps for a subterranean adventure.",
    "Dual Scenic Rail Trails: The out-and-back course uniquely connects the Badger State and Sugar River Trails, offering a remarkably flat, joint-friendly surface across historic trestle bridges.",
    "Ten Junk Miles Hospitality: Organized by the popular Ten Junk Miles podcast crew, the race is famous for its festive, high-energy aid stations and a finish-line celebration featuring free pizza and beer."
  ],
  "media": [
    {
      "url": "https://www.mychicagoathlete.com/race-review-sugar-badger-trail-races/",
      "title": "Race Review: Sugar Badger Trail Races",
      "type": "article",
      "source": "Chicago Athlete Magazine",
      "summary": "An editorial review detailing the race experience, including course conditions on the Badger and Sugar River trails, aid station quality, and the post-race atmosphere in Belleville.",
      "years": [
        2021
      ],
      "contentSummary": "The Sugar Badger Trail Races in Wisconsin, held on May 29, 2021, featured 50-mile, 50K, and half-marathon distances on scenic trails with detailed reports on course conditions, aid stations, and race winners.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Rachel",
          "lastName": "Ragona"
        },
        {
          "firstName": "Mike",
          "lastName": "Treder"
        },
        {
          "firstName": "Jen",
          "lastName": "Makovec"
        },
        {
          "firstName": "Jeff",
          "lastName": "Friedman"
        },
        {
          "firstName": "Mandi",
          "lastName": "Florip"
        },
        {
          "firstName": "Riley",
          "lastName": "Spahn"
        }
      ]
    },
    {
      "url": "https://secondrunnings.me/2021/06/01/race-report-sugar-badger-50k/",
      "title": "Race Report: Sugar Badger 50K",
      "type": "article",
      "source": "Second Runnings",
      "summary": "An in-depth profile of the 50K distance, describing the flat gravel rail-trail terrain and the specific logistical details of running the Badger State and Sugar River trails.",
      "years": [
        2021
      ],
      "contentSummary": "Jamison recounts his return to ultramarathon racing at the Sugar Badger 50K, where he utilized a mileage-based interval strategy to achieve a personal record on the flat trails of southern Wisconsin.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Brent",
          "lastName": "Hanson"
        }
      ]
    },
    {
      "url": "https://mychicagoathlete.com/race-review-sugar-badger-trail-races/",
      "title": "Race Review: Sugar Badger Trail Races",
      "type": "article",
      "source": "Chicago Athlete Magazine",
      "summary": "An editorial review of the Sugar Badger races highlighting the flat, soft rail-trail course, picturesque scenery through farmland, and the community-focused event atmosphere.",
      "years": [
        2021
      ],
      "contentSummary": "Mandi Florip reviews the 2021 Sugar Badger Trail Races in Wisconsin, highlighting the scenic course conditions, event amenities, and top finishers for the 50-mile, 50K, and half-marathon distances.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Rachel",
          "lastName": "Ragona"
        },
        {
          "firstName": "Mike",
          "lastName": "Treder"
        },
        {
          "firstName": "Jen",
          "lastName": "Makovec"
        },
        {
          "firstName": "Jeff",
          "lastName": "Friedman"
        },
        {
          "firstName": "Mandi",
          "lastName": "Florip"
        },
        {
          "firstName": "Riley",
          "lastName": "Spahn"
        }
      ]
    },
    {
      "url": "https://tenjunkmiles.libsyn.com/sugar-badger-5050-special-2022",
      "title": "Sugar Badger 50/50 Special - 2022",
      "type": "podcast",
      "source": "Ten Junk Miles",
      "summary": "A special live recording dedicated to the Sugar Badger 50/50 where organizers and veterans discuss course strategies, training, and the unique history of the Badger and Sugar River trails.",
      "years": [
        2022
      ],
      "contentSummary": "The Ten Junk Miles team discusses the upcoming 2022 Sugar Badger 50/50 during a live podcast recording at Arcteryx Chicago.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://trailrunningbook.com/races/sugar-badger-50-mile/",
      "title": "Sugar Badger 50 Mile - Trail Running Guide",
      "type": "article",
      "source": "Trail Running Book",
      "summary": "A comprehensive logistics and technical guide for the race, offering pace calculations, aid station charts, and detailed surface descriptions for prospective runners.",
      "years": [
        2025,
        2026
      ],
      "contentSummary": "This article serves as a complete logistical guide for the Sugar Badger 50 Mile trail race, offering details on the course, aid stations, rules, and travel tips for runners.",
      "qualityScore": 8,
      "tags": [
        "Preview"
      ],
      "racers": []
    }
  ]
}