{
  "slug": "ozark-foothills-endurance-runs",
  "lastUpdated": "2026-02-01T20:54:45.746Z",
  "summary": "Held at Greensfelder County Park in Wildwood, Missouri, the Ozark Foothills Endurance Runs is a premier trail event offering distances ranging from 25K to 100 miles on technical, single-track terrain. This springtime challenge tests athletes with steep grades and rocky foothills of the Ozark Mountains, all while maintaining a strong community focus through sustainability and inclusivity.",
  "uniqueFeatures": [
    "Technical Geological Terrain: The course traverses over 80% single-track trails characterized by 'picky' limestone and dolomite rocks that demand constant technical focus from runners.",
    "Dedicated Night-50K Option: The event offers a unique standalone Night-50K race, allowing participants to experience a mid-distance ultramarathon entirely under headlamps on the rugged Ozark trails.",
    "Strict Zero-Waste Policy: Operating as a cup-free event, the race requires all participants to bring their own reusable 'mess kits' (plate and utensils) for post-race meals to eliminate disposable waste."
  ],
  "media": [
    {
      "url": "https://terrain-mag.com/the-rise-of-ultra-endurance-sports/",
      "title": "The Rise of Ultra-Endurance Sports",
      "type": "article",
      "source": "Terrain Magazine",
      "summary": "An interview and feature on race director Shalini Kovach, discussing her philosophy on trail running and the founding of the Ozark Foothills Endurance Runs.",
      "years": [
        2019
      ],
      "contentSummary": "This feature article explores the psychological motivations and personal stories of athletes within the growing ultra-endurance community, highlighting the transition from traditional road racing to extreme distance events like 100-mile trail runs.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Shalini",
          "lastName": "Kovach"
        },
        {
          "firstName": "Tommy",
          "lastName": "Doais"
        },
        {
          "firstName": "Jen",
          "lastName": "Doais"
        },
        {
          "firstName": "Rosie",
          "lastName": "Smith"
        },
        {
          "firstName": "Lindsey",
          "lastName": "Harris"
        },
        {
          "firstName": "Emily",
          "lastName": "Korsch"
        }
      ]
    }
  ]
}