{
  "slug": "midwest-states-100",
  "lastUpdated": "2026-02-01T21:00:10.910Z",
  "summary": "The Midwest States 100 is a rugged wilderness ultramarathon held in the Chequamegon-Nicolet National Forest of Wisconsin, primarily navigating the glaciated terrain of the iconic Ice Age Trail. Runners tackle a challenging 34-hour cutoff through dense forests and rocky paths, experiencing a remote, grassroots atmosphere that purposefully lacks cellular service. This event offers a back-to-basics adventure where the trail’s natural beauty is matched by its technical difficulty and a tight-knit community of participants.",
  "uniqueFeatures": [
    "The 100K Decision Point: Upon reaching the 100-kilometer mark (which returns to the start/finish area), 100-mile entrants must decide whether to stop and be recorded as an official 100K finisher or head back out to complete the full 100-mile distance.",
    "Earn Your Flannel: In a nod to local culture, runners who complete any distance of the race three times are awarded a custom Midwest States Flannel, which can be further customized with distance-specific iron-on chevrons.",
    "Ice Age National Scenic Trail: The course utilizes a significant portion of one of only 11 National Scenic Trails in the U.S., taking runners through ancient landscapes featuring unique geological formations like kettles and moraines carved by glaciers."
  ],
  "media": [
    {
      "url": "https://irunfar.com/race-director-chronicles-michele-hartwig-and-ornery-mule-racing",
      "title": "Race Director Chronicles: Michele Hartwig and Ornery Mule Racing",
      "type": "interview",
      "source": "iRunFar",
      "summary": "An in-depth profile and interview exploring the creation of the Midwest States 100 and its mission to bring recognition to Wisconsin's technical trail running community.",
      "years": [
        2023
      ],
      "contentSummary": "An interview with Michele Hartwig, the founder of Ornery Mule Racing, exploring her career as an ultramarathon race director in the U.S. Midwest. Hartwig discusses the origins of her organization, the unique beauty and community of Midwest trails such as the Ice Age Trail, and the logistical challenges of managing large-scale events like the Hennepin 100 and Midwest States 100.",
      "qualityScore": 8,
      "tags": [
        "RD Chronicles",
        "Interview",
        "Ultrarunning",
        "Midwest Trail Running",
        "Ornery Mule Racing",
        "Race Directing"
      ],
      "racers": [
        {
          "firstName": "Michele",
          "lastName": "Hartwig"
        },
        {
          "firstName": "Chris",
          "lastName": "Worden"
        },
        {
          "firstName": "Andy",
          "lastName": "Jones-Wilkins"
        }
      ]
    },
    {
      "url": "https://podfollow.com/the-trailhead/episode/56c7576579075757d54407877c8e9d5e3966579e/view",
      "title": "The Joy of Midwest Trail Running",
      "type": "podcast",
      "source": "The Trailhead",
      "summary": "An interview with the race founder regarding the growth of Midwest ultrarunning and the specific character of the Midwest States 100 course.",
      "years": [
        2024
      ],
      "contentSummary": "The Trailhead by UltraSignup is a podcast hosted by Zoë Rom and Brendan Leonard that focuses on the culture and personal stories of trail running rather than race strategies. The content highlights several episodes featuring guests like Harvard biologist Dan Lieberman on human evolution, Atlantic CEO Nick Thompson on balancing elite training with life's challenges, and discussions on the minds behind extreme endurance events like the Barkley Marathons.",
      "qualityScore": 7,
      "tags": [
        "Podcast",
        "Interview",
        "Trail Running",
        "Ultrarunning",
        "Running Culture"
      ],
      "racers": [
        {
          "firstName": "Zoë",
          "lastName": "Rom"
        },
        {
          "firstName": "Brendan",
          "lastName": "Leonard"
        },
        {
          "firstName": "Doug",
          "lastName": "Mayer"
        },
        {
          "firstName": "Romy",
          "lastName": "Ancona"
        },
        {
          "firstName": "Lindsey",
          "lastName": "Freeman"
        },
        {
          "firstName": "Raziq",
          "lastName": "Rauf"
        },
        {
          "firstName": "Nick",
          "lastName": "Thompson"
        },
        {
          "firstName": "Jared",
          "lastName": "Beasley"
        },
        {
          "firstName": "Lazarus",
          "lastName": "Lake"
        },
        {
          "firstName": "Dan",
          "lastName": "Lieberman"
        },
        {
          "firstName": "Joe",
          "lastName": "Grant"
        }
      ]
    },
    {
      "url": "https://banditcoaching.com/blog/race-report-2024-midwest-states-100",
      "title": "Race Report: 2024 Midwest States 100",
      "type": "article",
      "source": "Bandit Coaching",
      "summary": "A technical course profile and editorial review that details the 'sneaky tough' nature of the Wisconsin terrain and the unique self-supported feel of the remote National Forest location.",
      "years": [
        2024
      ],
      "contentSummary": "Gibson Kelley provides a detailed first-person account of the 2024 Midwest States 100, describing the race's remote grassroots atmosphere and the physically demanding technical terrain featuring mud pits and fallen trees.",
      "qualityScore": 8,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Gibson",
          "lastName": "Kelley"
        }
      ]
    }
  ]
}