{
  "slug": "two-hearted-trail-run",
  "lastUpdated": "2026-02-01T20:58:21.072Z",
  "summary": "The Two Hearted Trail Run is a remote wilderness ultramarathon held in the northeastern Upper Peninsula of Michigan, set within the rugged landscapes that inspired Ernest Hemingway's literature. Runners navigate a challenging course of sandy single-track and high bluffs along the Lake Superior shoreline before finishing at the iconic Upper Tahquamenon Falls.",
  "uniqueFeatures": [
    "Upper Tahquamenon Falls Finish: All race distances culminate at the second-largest waterfall east of the Mississippi, famous for its amber-colored water and massive 200-foot-wide drop.",
    "Giant Pines Trail: The course traverses a rare section of old-growth forest containing massive white pines that are estimated to be between 300 and 400 years old.",
    "Two Hearted River Footbridge: Competitors in the 50K and marathon must cross a narrow, cabled footbridge at the mouth of the Two Hearted River, offering a unique vantage point where the river flows into Lake Superior."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://michiganrunnergirl.libsyn.com/ep098-jeff-crumbaugh-of-great-lakes-endurance-on-his-eco-friendly-trail-races-in-northern-michigan-the-up-northern-wisconsin",
      "title": "Episode #98: Jeff Crumbaugh of Great Lakes Endurance on his eco-friendly trail races",
      "type": "podcast",
      "source": "Michigan Runner Girl",
      "summary": "A podcast interview featuring race director Jeff Crumbaugh, who provides insights into the sustainable mission and course design of the Two Hearted Trail Run and other regional events.",
      "years": [
        2017
      ],
      "contentSummary": "In this podcast episode, Heather Durocher interviews Jeff Crumbaugh, the founder of Great Lakes Endurance. They discuss his commitment to ecologically mindful trail running and the organization of various races across Michigan and Wisconsin, including the Grand Island Trail Run and the Two Hearted Trail Run. The conversation highlights the company's focus on land conservancy, sustainable trail construction, and upcoming events including winter snowshoe races.",
      "qualityScore": 8,
      "tags": [
        "Podcast",
        "Interview",
        "Trail Running",
        "Sustainability",
        "Great Lakes Endurance",
        "Two Hearted Trail Run",
        "Grand Island Trail Run"
      ],
      "racers": [
        {
          "firstName": "Jeff",
          "lastName": "Crumbaugh"
        },
        {
          "firstName": "Heather",
          "lastName": "Durocher"
        }
      ]
    },
    {
      "url": "http://www.detroitrunner.com/2015/06/two-hearted-half-marathon-race-review.html",
      "title": "Two Hearted Half Marathon Race Review",
      "type": "article",
      "source": "Detroit Runner",
      "summary": "A detailed editorial review and course profile describing the technical singletrack, scenic bluffs, and unique landmarks like the Two Hearted River swinging bridge.",
      "years": [
        2015
      ],
      "contentSummary": "A comprehensive first-person race report of the Two Hearted Half Marathon in Michigan's Upper Peninsula. The author details the logistics of packet pickup in Newberry, camping at Tahquamenon Falls State Park, and provides a mile-by-mile description of the technical singletrack course. Key highlights include the technical terrain involving ferns and beaver dams, the requirement for runners to carry their own water for environmental reasons, and the observation that the course ran approximately half a mile short of the standard distance.",
      "qualityScore": 8,
      "tags": [
        "Race Report",
        "Half Marathon",
        "Trail Running",
        "Michigan",
        "Course Review",
        "Great Lakes Endurance"
      ],
      "racers": [
        {
          "firstName": "Jeff",
          "lastName": "Crumbaugh"
        }
      ]
    },
    {
      "url": "https://endurancesportswire.com/aravaipa-running-to-continue-the-legacy-of-great-lakes-endurance/",
      "title": "Aravaipa Running to Continue the Legacy of Great Lakes Endurance",
      "type": "news",
      "source": "Endurance Sportswire",
      "summary": "An editorial profile detailing the transition of race management and highlighting the Two Hearted Trail Run's hallmark status as a celebrated, ecologically-focused event in Michigan's wild landscapes.",
      "years": [
        2025
      ],
      "contentSummary": "Aravaipa Running has taken over stewardship of Great Lakes Endurance and its five hallmark Midwest trail races, committing to maintain the environmental and community values established by founders Jeff Crumbaugh and Lois Bressette.",
      "qualityScore": 7,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Jeff",
          "lastName": "Crumbaugh"
        },
        {
          "firstName": "Lois",
          "lastName": "Bressette"
        },
        {
          "firstName": "Jamil",
          "lastName": "Coury"
        }
      ]
    }
  ]
}