{
  "slug": "snakebite",
  "lastUpdated": "2026-02-01T20:51:28.522Z",
  "summary": "The Yeti Snakebite 50/50 is a grueling 'summer sufferfest' held in the sweltering August heat and humidity of Sweetwater Creek State Park in Georgia. Runners tackle a deceptively challenging 6-mile loop of rocky terrain and relentless hills, pushing their mental and physical limits in what is often described as an old-school test of grit.",
  "uniqueFeatures": [
    "8.88-Hour Time Limit: Rather than a standard race to a finish line, participants have exactly 8.88 hours to complete as many loops as possible, shifting the focus from speed to pure endurance.",
    "Strict No-DNF Policy: The race is designed so that every runner is celebrated for the distance they achieve; as long as you start, you are considered a finisher of whatever distance you complete within the time limit.",
    "Secret Menu Beyond 50K: For the most resilient athletes who surpass the 50-kilometer mark before the clock runs out, the race offers a legendary 'secret menu' of additional challenges known only to those who reach it."
  ],
  "videos": [],
  "media": [
    {
      "url": "https://www.youtube.com/watch?v=zoCE6fubc7s",
      "title": "YETI SNAKEBITE 50K TRAIL RACE RECAP (Video Interview)",
      "type": "interview",
      "source": "UltraTrailSteven",
      "summary": "A podcast-style discussion examining the mental challenges of the race's multi-loop format and the specific pacing strategies required for the Georgia humidity.",
      "years": [
        2020
      ],
      "contentSummary": "A video interview and race recap providing a detailed look at the Yeti Snakebite 50k trail race.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": []
    },
    {
      "url": "http://spiritofthemaster.blogspot.com/2016/08/yeti-snakebite-50k-race-report-2016.html",
      "title": "The Beast of Georgia: A Profile of the Yeti Snakebite 50K",
      "type": "article",
      "source": "Spirit of the Master",
      "summary": "A timeless long-form article exploring the deceptive difficulty of the course's elevation gain and the 'old-school' grit required to finish the late-summer event.",
      "years": [
        2016
      ],
      "contentSummary": "A detailed personal race report of the 2016 Yeti Snakebite 50K highlighting the deceptive course difficulty, technical trail features, and the mental challenge of completing three loops.",
      "qualityScore": 7,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Cary",
          "lastName": "Long"
        }
      ]
    }
  ]
}