{
  "slug": "mcclellan-madness",
  "lastUpdated": "2026-02-01T20:52:08.421Z",
  "summary": "McClellan Madness is a timed endurance event held at the historic Fort McClellan in Anniston, Alabama, where runners tackle a 4.1-mile single-track loop over a 4 or 8-hour period. Set on a former U.S. Army training base, the race combines rolling forest trails with a festive atmosphere supported by a high-energy central aid station.",
  "uniqueFeatures": [
    "Military History & Mystery: The course traverses a former WWII Army post, where runners receive a unique safety briefing about staying on the trail to avoid potential legacy unexploded ordnance from the base's training days.",
    "Performance-Based Milestones: While it is a timed race, participants can earn specialized medals by reaching specific distance benchmarks, such as 16 miles in the 4-hour event or a full 50k in the 8-hour event.",
    "Signature Aid Station Fare: The event is locally famous for its hospitality, specifically the central aid station that serves freshly grilled cheese sandwiches (including vegan options) to fuel runners through their multiple laps."
  ],
  "media": [
    {
      "url": "https://calhounjournal.com/runners-gear-up-for-dirty-soles-trail-race-at-fort-mcclellan/",
      "title": "Runners Gear Up for Dirty Soles Trail Race at Fort McClellan",
      "type": "news",
      "source": "Calhoun Journal",
      "summary": "An editorial news profile detailing the event's 4.1-mile single-track loop and the historical context of the Fort McClellan trails.",
      "years": [
        2025
      ],
      "contentSummary": "The Dirty Soles Trail Race will take place on March 1 at Fort McClellan, featuring four-hour and eight-hour endurance loops on a 4.1-mile trail to support local trail maintenance.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://calhounjournal.com/anniston-gears-up-for-the-third-annual-mcclellan-madness-endurance-run/",
      "title": "Anniston Gears Up for the Third Annual McClellan Madness Endurance Run",
      "type": "news",
      "source": "Calhoun Journal",
      "summary": "A local news feature covering the growth of the race and providing technical details on the 4-hour and 8-hour endurance formats.",
      "years": [
        2024
      ],
      "contentSummary": "The Third Annual McClellan Madness Endurance Run, hosted by the McClellan Development Authority, will take place on March 9, 2024, in Anniston, Alabama, featuring 4-hour and 8-hour timed race options.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://easportstoday.com/2022/08/12/in-the-long-run/",
      "title": "In the long run: Ultra-marathoners hit the trail in White Plains area",
      "type": "article",
      "source": "East Alabama Sports Today",
      "summary": "A timeless profile of the race series and its director, Becki Jones, detailing the philosophy of the McClellan Madness and the mental endurance required for timed ultra events.",
      "years": [
        2022
      ],
      "contentSummary": "This article previews the inaugural In the Heat of the Night 100K trail race in the White Plains area, featuring various distances and highlighting local favorites for the overnight competition.",
      "qualityScore": 7,
      "tags": [
        "Preview"
      ],
      "racers": [
        {
          "firstName": "Fulton",
          "lastName": "Williams"
        },
        {
          "firstName": "Sam",
          "lastName": "Kuhn"
        },
        {
          "firstName": "Matthew",
          "lastName": "Deyo"
        },
        {
          "firstName": "Patrick",
          "lastName": "Bussey"
        },
        {
          "firstName": "Jamie",
          "lastName": "Limbaugh"
        }
      ]
    }
  ]
}