{
  "slug": "incline-vista",
  "lastUpdated": "2026-02-01T20:54:29.444Z",
  "summary": "Incline Vista is a premier trail race held in Redmond, Oregon, that serves as a challenging early-season opener on the rugged, high-desert terrain of Cline Butte. The event features a 20-mile course that guides runners through newly built singletrack and technical rock sections, culminating in a spectacular summit experience with views of the Central Oregon landscape.",
  "uniqueFeatures": [
    "360-Degree Volcanic Panoramas: The summit of Cline Butte provides an unparalleled vantage point with 360-degree views of the Cascade volcanoes to the west and the jagged peaks of Smith Rock and the Ochoco Mountains to the east.",
    "Inaugural Sanctioned Access: It is the first-ever sanctioned trail race to take place on Cline Butte, utilizing a network of recently constructed trails that link previously disconnected high-desert routes.",
    "Dynamic High-Desert Terrain: The course is designed with a rhythmic mix of fast, runnable stretches and 'pockets of technical rocky trail,' offering 2,000 feet of elevation gain that tests both speed and technical agility."
  ],
  "media": [
    {
      "url": "https://runoregonblog.com/2025/03/19/butte-iful-challenge-alpine-runnings-inaugural-incline-vista/",
      "title": "Butte-iful Challenge: Alpine Running's Inaugural Incline Vista",
      "type": "article",
      "source": "Run Oregon",
      "summary": "An editorial race profile highlighting the inaugural 20-mile and half-marathon courses on Cline Butte, detailing the technical terrain and 360-degree views of the Cascades.",
      "years": [
        2025
      ],
      "contentSummary": "Alpine Running is launching the inaugural Incline Vista trail race in Redmond, Oregon, featuring 20-mile and half-marathon distances that showcase views of the Cascades and Smith Rock.",
      "qualityScore": 6,
      "tags": [
        "Preview"
      ],
      "racers": []
    },
    {
      "url": "https://www.irunfar.com/catching-up-with-janessa-taylor",
      "title": "Catching Up With Janessa Taylor",
      "type": "interview",
      "source": "iRunFar",
      "summary": "A deep-dive profile of Alpine Running co-founder Janessa Taylor, exploring her philosophy as a race director and the growth of her trail event series in Central Oregon.",
      "years": [
        2020
      ],
      "contentSummary": "An in-depth profile and interview with ultrarunner Janessa Taylor as part of a series checking in with athletes during the 2020 pandemic.",
      "qualityScore": 8,
      "tags": [
        "Other"
      ],
      "racers": [
        {
          "firstName": "Janessa",
          "lastName": "Taylor"
        }
      ]
    }
  ]
}