{
  "slug": "skunk-apes-revenge-60k",
  "lastUpdated": "2026-02-01T20:51:18.091Z",
  "summary": "Held in the rugged Green Swamp of Dade City, Florida, the Skunk Apes Revenge 60K is a gritty endurance challenge that plunges runners into the heart of untamed wetlands. Participants traverse a grueling variety of terrain including sugar sand, fire berms, and single-track segments of the Florida Trail, all while listening for the calls of coyotes and the legendary cryptid that gives the race its name.",
  "uniqueFeatures": [
    "Diverse Florida Ecosystems: The course is a comprehensive 'Florida terrain gauntlet,' featuring everything from muddy pasture lanes and dense swamp trails to challenging sugar sand and steep fire berms.",
    "Cryptid-Themed Atmosphere: The race leans into Florida folklore, offering a wilderness experience where the sounds of hooting owls and buzzing insects create an immersive, slightly eerie environment inspired by the Skunk Ape legend.",
    "Distinctive Rewards and Support: Beyond standard medals, finishers receive custom hats and collectible patches, while the event serves a dual purpose as a community pet food drive for the local charity 'Cindy’s Pets.'"
  ],
  "videos": [],
  "media": [
    {
      "url": "https://podcasters.spotify.com/pod/show/wheres-the-finish/episodes/Talking-About-Ourselves-and-the-Skunk-Apes-Revenge-60k-e2fqc9l",
      "title": "Talking About Ourselves and the Skunk Ape's Revenge 60k",
      "type": "podcast",
      "source": "Where's The Finish Podcast",
      "summary": "A deep-dive podcast episode featuring an overview of the Skunk Ape's Revenge 60K race experience, its history, and the unique Florida trail culture.",
      "years": [
        2024
      ],
      "contentSummary": "This podcast episode features a personal race recap and discussion regarding the participants' experiences at the Skunk Ape's Revenge 60k trail race.",
      "qualityScore": 6,
      "tags": [
        "Report"
      ],
      "racers": []
    },
    {
      "url": "https://podtail.com/podcast/where-s-the-finish/joe-fuller-talks-all-things-skunk-ape/",
      "title": "Joe Fuller Talks All Things Skunk Ape",
      "type": "podcast",
      "source": "Where's The Finish Podcast",
      "summary": "Race director Joe Fuller discusses the origins and technical challenges of the Skunk Ape race series, including specific course insights for the 60K and 100M events.",
      "years": [
        2024
      ],
      "contentSummary": "Joe Fuller shares his running history and provides a preview of the upcoming Skunk Ape 100 and 50-mile races, including the introduction of the challenging Berm 2.0 course feature.",
      "qualityScore": 8,
      "tags": [
        "Preview"
      ],
      "racers": [
        {
          "firstName": "Joe",
          "lastName": "Fuller"
        }
      ]
    },
    {
      "url": "https://podtail.com/podcast/where-s-the-finish/talking-about-ourselves-and-the-skunk-ape-s-reveng/",
      "title": "A Deep Dive into the Skunk Ape’s Revenge 60k",
      "type": "podcast",
      "source": "Where's The Finish Podcast",
      "summary": "The inaugural episode of this trail-focused podcast features an in-depth review of the Skunk Ape's Revenge 60k, highlighting the unique ecosystem of the Green Swamp West Tract.",
      "years": [
        2024
      ],
      "contentSummary": "Hosts Shae, Joe, and Kevin discuss their personal running histories and provide a detailed race report for the Skunk Ape's Revenge 60k held in February 2024.",
      "qualityScore": 6,
      "tags": [
        "Report"
      ],
      "racers": [
        {
          "firstName": "Jesse",
          "lastName": "Schultz"
        },
        {
          "firstName": "Winston",
          "lastName": "Fletcher"
        },
        {
          "firstName": "Emily",
          "lastName": "Quintanilla"
        },
        {
          "firstName": "Francis",
          "lastName": "Quintanilla"
        },
        {
          "firstName": "Ary",
          "lastName": "Rochon"
        },
        {
          "firstName": "Val",
          "lastName": "Rochon"
        },
        {
          "firstName": "Jada",
          "lastName": "Freer"
        },
        {
          "firstName": "Andy",
          "lastName": "Mathews"
        },
        {
          "firstName": "Jakub",
          "lastName": "Rehacek"
        },
        {
          "firstName": "Jonathan",
          "lastName": "Reid"
        },
        {
          "firstName": "Lindsey",
          "lastName": "Reid"
        }
      ]
    }
  ]
}